// Акт взаимных расчетов с факсимиле (УТ 11.4)
//


// Подключение внешней обработки

Функция СведенияОВнешнейОбработке() экспорт
    ПараметрыРегистрации = Новый Структура;
    МассивНазначений = Новый Массив;
    МассивНазначений.Добавить("Документ.СверкаВзаиморасчетов"); //Указываем документ к которому делаем внешнюю печ. форму
    ПараметрыРегистрации.Вставить("Вид", "ПечатнаяФорма"); //может быть - ПечатнаяФорма, ЗаполнениеОбъекта, ДополнительныйОтчет, СозданиеСвязанныхОбъектов... 
    ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
    ПараметрыРегистрации.Вставить("Наименование", "Акт сверки с факсимиле"); //имя под которым обработка будет зарегестрирована в справочнике внешних обработок
    ПараметрыРегистрации.Вставить("БезопасныйРежим", ЛОЖЬ);
    ПараметрыРегистрации.Вставить("Версия", "1.0"); 
    ПараметрыРегистрации.Вставить("Информация", "Заказная ВПФ"); 
    ТаблицаКоманд = ПолучитьТаблицуКоманд();
    ДобавитьКоманду(ТаблицаКоманд, "Акт сверки с факсимиле", "АктСверкиВзаимныхРасчетов", "ВызовСерверногоМетода", Истина, "ПечатьMXL");
    ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
    Возврат ПараметрыРегистрации;
КонецФункции

Функция ПолучитьТаблицуКоманд()
    Команды = Новый ТаблицаЗначений;
    Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));//как будет выглядеть описание печ.формы для пользователя
    Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка")); //имя макета печ.формы
    Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка")); //ВызовСерверногоМетода
    Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
    Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
    Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
    НоваяКоманда = ТаблицаКоманд.Добавить();
    НоваяКоманда.Представление = Представление; 
    НоваяКоманда.Идентификатор = Идентификатор;
    НоваяКоманда.Использование = Использование;
    НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
    НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры

// -- Подключение внешней обработки


// Печать
Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	ПараметрыПечати = Новый Структура();
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСверкиВзаимныхРасчетов") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"АктСверкиВзаимныхРасчетов",
			НСтр("ru='Акт сверки взаимных расчетов'"),
			СформироватьПечатнуюФормуАктСверкиВзаиморасчетов(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуАктСверкиВзаиморасчетов(МассивОбъектов, ОбъектыПечати, ДляОтладки = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	НастройкиПечати = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
							КлючОбъектаПользовательскихНастроек(),
							"НастройкиПечати");
	Если НастройкиПечати = Неопределено Тогда
		НастройкиПечати = НастройкиПечатиПоУмолчанию();
	КонецЕсли;
	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
	НастройкиПечати.Вставить("ВалютаРегл", ВалютаРегл);
	Если ТипЗнч(ДляОтладки) = Тип("Структура") Тогда
		НастройкиПечати.Вставить("ДляОтладки", ДляОтладки);
	КонецЕсли;
	
	ЗапросДанныеНаПечать = ЗапросДанныеНаПечать(МассивОбъектов, НастройкиПечати);
	РезультатЗапроса = ЗапросДанныеНаПечать.Выполнить();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ПервыйДокумент = Истина;
	ДанныеСверки = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	Для Каждого ДанныеДокумента Из ДанныеСверки.Строки Цикл
		
		Макет = ПолучитьМакет("АктСверкиВзаимныхРасчетовФаксимиле"); // ТабличныйДокумент - 
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		#Область ШапкаДокумента
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ДанныеДокумента.ДокументСсылка);
		
		ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(ДанныеДокумента, НСтр("ru='Акт сверки взаимных расчетов'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
		ЕстьОстаткиОборотыЗаПериод = ДанныеДокумента.ЕстьОбороты ИЛИ ДанныеДокумента.НачальноеСальдоДт <> 0 ИЛИ ДанныеДокумента.НачальноеСальдоКт <> 0
			ИЛИ ДанныеДокумента.КонечноеСальдоДт <> 0 ИЛИ ДанныеДокумента.КонечноеСальдоКт <> 0;
		
		Если ДанныеДокумента.НачалоПериода = '00010101' Тогда
			
			ПредставлениеПериода = СтрШаблон(НСтр("ru = 'по состоянию на %1'", ОбщегоНазначения.КодОсновногоЯзыка()), Формат(ДанныеДокумента.КонецПериода, "ДЛФ=ДД"),);
			
			ПредставлениеПериодаРасчетов = СтрШаблон(НСтр("ru = 'По состоянию на %1'", ОбщегоНазначения.КодОсновногоЯзыка()), Формат(ДанныеДокумента.КонецПериода, "ДЛФ=ДД"),);
			
		Иначе
			
			ПредставлениеПериода = ПредставлениеПериода(ДанныеДокумента.НачалоПериода, КонецДня(ДанныеДокумента.КонецПериода));

			ПервыйСимволПредставлениеПериода = Лев(ПредставлениеПериода, 1);
			Если  КодСимвола(ПервыйСимволПредставлениеПериода) >= 48
				И КодСимвола(ПервыйСимволПредставлениеПериода) <= 57 Тогда
				ПредставлениеПериода = СтрШаблон(НСтр("ru='за период: %1'", ОбщегоНазначения.КодОсновногоЯзыка()), ПредставлениеПериода);
				
			Иначе
				ПредставлениеПериода = СтрШаблон(НСтр("ru='за %1'", ОбщегоНазначения.КодОсновногоЯзыка()), ПредставлениеПериода);
				
			КонецЕсли;
			
			ШаблонПериодаРасчетов = НСтр("ru = 'В период с %1 по %2 были осуществлены следующие расчеты'", ОбщегоНазначения.КодОсновногоЯзыка())+":";
			Если НЕ ЕстьОстаткиОборотыЗаПериод Тогда
				ШаблонПериодаРасчетов = НСтр("ru = 'В период с %1 по %2 операции по расчетам не производились.'", ОбщегоНазначения.КодОсновногоЯзыка());
			КонецЕсли;
			
			ПредставлениеПериодаРасчетов = СтрШаблон(
				ШаблонПериодаРасчетов,
				Формат(ДанныеДокумента.НачалоПериода, "ДЛФ=ДД"),
				Формат(ДанныеДокумента.КонецПериода, "ДЛФ=ДД"),);
			
		КонецЕсли;

		СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеДокумента.Организация, ДанныеДокумента.Дата);
		ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, 
									"ПолноеНаименование");
		СведенияОКонтрагенте  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеДокумента.Контрагент,  ДанныеДокумента.Дата);
		КонтрагентНаименование = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКонтрагенте, 
								  "ПолноеНаименование");
		
		СтруктураПредставленийУчастников = Новый Структура;
		СтруктураПредставленийУчастников.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
		СтруктураПредставленийУчастников.Вставить("КонтрагентНаименование", КонтрагентНаименование);
		
		ОбластьМакета.Параметры.Заполнить(ДанныеДокумента);
		Если ЗначениеЗаполнено(ДанныеДокумента.Договор) Тогда
			ОбластьМакета.Параметры.ПредставлениеДоговора = НСтр("ru = 'по договору'", ОбщегоНазначения.КодОсновногоЯзыка()) + ": " + ДанныеДокумента.ПредставлениеДоговора;
		КонецЕсли;
		ОбластьМакета.Параметры.Заполнить(СтруктураПредставленийУчастников);
		ОбластьМакета.Параметры.ТекстЗаголовкаМакета         = ТекстЗаголовка;
		ОбластьМакета.Параметры.ФИОРуководителяКонтрагента   = СокрЛП(ДанныеДокумента.ФИОРуководителяКонтрагента);
		ОбластьМакета.Параметры.ПредставлениеПериода         = ПредставлениеПериода;
		ОбластьМакета.Параметры.ПредставлениеПериодаРасчетов = ПредставлениеПериодаРасчетов;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		#КонецОбласти
		
		#Область ДетальныеЗаписи
		ТипЧисло = ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля();
		ИтогоЗадолженность = Новый ТаблицаЗначений;
		ИтогоЗадолженность.Колонки.Добавить("Валюта");
		ИтогоЗадолженность.Колонки.Добавить("СуммаДт", ТипЧисло);
		ИтогоЗадолженность.Колонки.Добавить("СуммаКт", ТипЧисло);
		НастройкиПечати.Вставить("ПредставленияУчастников", СтруктураПредставленийУчастников);
		Для Каждого ДанныеПоТипуРасчетов Из ДанныеДокумента.Строки Цикл
			Для Каждого ДанныеПоВалюте Из ДанныеПоТипуРасчетов.Строки Цикл
				ДанныеПоВалюте.Строки.Сортировать("ОбъектГруппировки");
				Для Каждого ДанныеПоОбъектуГруппировки Из ДанныеПоВалюте.Строки Цикл
					ЕстьДанныеГруппировки = ДанныеПоОбъектуГруппировки.НачальноеСальдоДт <> 0
												ИЛИ ДанныеПоОбъектуГруппировки.НачальноеСальдоКт <> 0
												ИЛИ ДанныеПоОбъектуГруппировки.ЕстьОбороты;
					Если ЕстьДанныеГруппировки Тогда
						ТабличныйДокумент.Вывести(ВывестиДетальныеЗаписи(ДанныеПоОбъектуГруппировки, ДанныеДокумента, Макет, ИтогоЗадолженность, НастройкиПечати));
					КонецЕсли;
				КонецЦикла; // по детальным записям
			КонецЦикла; // по детальным записям
		КонецЦикла; // по видам расчетов Взаиморасчеты/ФинансовыеИнструменты
		#КонецОбласти
		
		#Область Задолженность
		Если ИтогоЗадолженность.Количество() > 0 Тогда
			
			ОбластьМакетаЗаголовок	= Макет.ПолучитьОбласть("ЗаголовокЗадолженность");
			ОбластьДолг				= Макет.ПолучитьОбласть("СтрокаЗадолженность");
			ОбластьДолгРегл			= Макет.ПолучитьОбласть("СтрокаЗадолженностьВалютаРегл");
			ОбластьПустаяСтрока		= Макет.ПолучитьОбласть("ПустаяСтрока");
			
			ОбластьМакетаЗаголовок.Параметры.КонецПериодаСверки = Формат(ДанныеДокумента.КонецПериода, "ДЛФ=ДД");
			ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовок);
			
			ЗадолженностьПоВалютам = ИтогоЗадолженность.Скопировать(); // ТаблицаЗначений
			ЗадолженностьПоВалютам.Свернуть("Валюта", "СуммаДт,СуммаКт");
			Для Каждого ДолгВВалюте Из ЗадолженностьПоВалютам Цикл
				
				ВывестиПустуюСтроку = Истина;
				ПредставлениеПартнера = ДанныеДокумента.ПредставлениеПартнера;
				Если НЕ ЗначениеЗаполнено(ДанныеДокумента.Партнер) Тогда
					ПредставлениеПартнера = СтруктураПредставленийУчастников.КонтрагентНаименование;
				КонецЕсли;
				
				Если ДолгВВалюте.СуммаДт <> 0 И ДолгВВалюте.СуммаКт <> 0 Тогда
					РассчитатьСальдо(ДолгВВалюте, "Сумма");
				КонецЕсли;
				
				ОбластьДолг.Параметры.Валюта = ДолгВВалюте.Валюта;
				
				// Долг партнера
				СуммаДолга = 0;
				Если ДолгВВалюте.СуммаДт > 0 Тогда
					СуммаДолга = ДолгВВалюте.СуммаДт;
					ОбластьДолг.Параметры.Сумма = Формат(ДолгВВалюте.СуммаДт, "ЧДЦ=2; ЧН=0; ЧГ=3,0");
					ОбластьДолг.Параметры.Дебитор = ПредставлениеПартнера;
				Иначе
					// Наш долг
					СуммаДолга = ДолгВВалюте.СуммаКт;
					ОбластьДолг.Параметры.Сумма = Формат(ДолгВВалюте.СуммаКт, "ЧДЦ=2; ЧН=0; ЧГ=3,0");
					ОбластьДолг.Параметры.Дебитор = СтрШаблон(
							НСтр("ru='%1 перед %2'"),
							СтруктураПредставленийУчастников.ПредставлениеОрганизации,
							ПредставлениеПартнера);
				КонецЕсли;
				ОбластьДолг.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаДолга,ДолгВВалюте.Валюта);
				ТабличныйДокумент.Вывести(ОбластьДолг);
				
				Если ВывестиПустуюСтроку Тогда
					ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
				КонецЕсли;
			КонецЦикла; 
			
		Иначе
		
			ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокЗадолженностьОтсутствует");
			ОбластьМакета.Параметры.КонецПериодаСверки = Формат(ДанныеДокумента.КонецПериода, "ДЛФ=ДД");
			ТабличныйДокумент.Вывести(ОбластьМакета);
		
		КонецЕсли;
		#КонецОбласти 
		
		// РАСХОЖДЕНИЙ НЕ ВЫЯВЛЕНО
		ДанныеКонтрагентаЗаполнены = НЕ НастройкиПечати.НеЗаполнятьДанныеКонтрагента;
		Если НЕ ДанныеДокумента.ЕстьРасхождения И ДанныеКонтрагентаЗаполнены Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокРасхождения");
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		
		#Область Подписи
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ОбластьМакета.Параметры.Заполнить(ДанныеДокумента);
		ОбластьМакета.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, 
												  			  "ПолноеНаименование,ИНН,ЮридическийАдрес");
		ОбластьМакета.Параметры.КонтрагентНаименование   = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКонтрагенте, 
												  			  "ПолноеНаименование,ИНН,ЮридическийАдрес");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		#КонецОбласти
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДокумента.ДокументСсылка);
	
	КонецЦикла; // конец цикла по данным документа

	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Если ТипЗнч(ДляОтладки) = Тип("Структура") Тогда
		ДляОтладки.Вставить("ТабличныйДокумент", ТабличныйДокумент);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
//-- Печать


// Возвращает КлючОбъекта для сохранения в хранилище общих настроек пользователя
Функция КлючОбъектаПользовательскихНастроек() Экспорт
	
	Возврат "Документ.СверкаВзаиморасчетов";
	
КонецФункции

Функция НастройкиПечатиПоУмолчанию() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ВыводитьВВалютеРегл", Истина);
	Результат.Вставить("ДетализацияВзаиморасчетов", 0);
	Результат.Вставить("ДетализацияФинансовыхИнструментов", 0);
	Результат.Вставить("ДолгКакДебет", Истина);
	Результат.Вставить("НеЗаполнятьДанныеКонтрагента", Ложь);
	Результат.Вставить("ОбъединитьКлиентовПоставщиков", Истина);
	Возврат Результат;
	
КонецФункции 

Функция ЗапросДанныеНаПечать(МассивОбъектов, НастройкиПечати) Экспорт
	
	РасшифроватьНастройкуДетализации(НастройкиПечати);
	
	ЗапросДанныеДокумента = Новый Запрос;
	МенеджерВременныхТаблиц = ИнициализироватьМенеджерТаблиц(МассивОбъектов);
	ЗапросДанныеДокумента.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ЗапросДанныеДокумента.Текст = ТекстЗапросаДанныеДокумента(НастройкиПечати);
	
	ЗапросДанныеДокумента.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросДанныеДокумента.УстановитьПараметр("ДолгКакДебет", НастройкиПечати.ДолгКакДебет);
	ЗапросДанныеДокумента.УстановитьПараметр("ВыводитьВВалютеРегл", НастройкиПечати.ВыводитьВВалютеРегл);
	ЗапросДанныеДокумента.УстановитьПараметр("ВалютаРегл", Константы.ВалютаРегламентированногоУчета.Получить());
	ЗапросДанныеДокумента.УстановитьПараметр("ОбъединитьКлиентовПоставщиков", НастройкиПечати.ОбъединитьКлиентовПоставщиков);
	
	ЗапросДанныеДокумента.УстановитьПараметр("АрендныеОбязательства", Неопределено);
	ЗапросДанныеДокумента.УстановитьПараметр("ОбеспечительныйПлатеж", Неопределено);
	ЗапросДанныеДокумента.УстановитьПараметр("ЛизинговыйПлатеж", Неопределено);
	ЗапросДанныеДокумента.УстановитьПараметр("ВыкупПредметаЛизинга", Неопределено);

	Если НастройкиПечати.Свойство("ДляОтладки") Тогда
		Если НастройкиПечати.ДляОтладки.Свойство("ЗапросДанныеНаПечать") Тогда
			ЗапросДанныеДокумента = НастройкиПечати.ДляОтладки.ЗапросДанныеНаПечать;
			ЗапросДанныеДокумента.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			НастройкиПечати.ДляОтладки.Вставить("МенеджерВременныхТаблиц", ИнициализироватьМенеджерТаблиц(МассивОбъектов));
		КонецЕсли;
	КонецЕсли;

	Возврат ЗапросДанныеДокумента;

КонецФункции

Функция ВывестиДетальныеЗаписиПоСтарому(
	ВыборкаДетальныхЗаписей,
	ДанныеДокумента,
	СтруктураПредставленийУчастников,
	Макет,
	ТаблицаЗадолженности,
	ТекущийПартнер = Неопределено,
	ТекущийДоговор = Неопределено)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ОбластьМакетаГруппировка = Макет.ПолучитьОбласть("ГруппировкаПартнерВалюта");
	ОбластьМакетаШапка		 = Макет.ПолучитьОбласть("ШапкаТаблицыРасчеты");
	ОбластьМакетаНачОстаток  = Макет.ПолучитьОбласть("СтрокаТаблицыРасчетыНачОстаток");
	ОбластьМакетаСтрока 	 = Макет.ПолучитьОбласть("СтрокаТаблицыРасчеты");
	ОбластьМакетаКонОстаток  = Макет.ПолучитьОбласть("СтрокаТаблицыРасчетыКонОстаток");
	
	СтрокаЗадолженности = ТаблицаЗадолженности.Добавить();
	СтрокаЗадолженности.Валюта = ВыборкаДетальныхЗаписей.Валюта;
	Если ТаблицаЗадолженности.Колонки.Найти("Партнер") <> Неопределено Тогда
		СтрокаЗадолженности.Партнер = ?(ДанныеДокумента.РасшифровкаПоПартнерам,
										ПредставлениеПартнера(ТекущийПартнер),
										ПредставлениеПартнера(ДанныеДокумента.Партнер));
	КонецЕсли;
	Если ТаблицаЗадолженности.Колонки.Найти("Договор") <> Неопределено Тогда
		СтрокаЗадолженности.Договор = ?(ДанныеДокумента.РасшифровкаПоДоговорам,
										ПредставлениеДоговора(ТекущийДоговор),
										ПредставлениеДоговора(ДанныеДокумента.Договор));
	КонецЕсли;
	Если ДанныеДокумента.РасшифровкаПоПартнерам Тогда 
		ОбластьМакетаГруппировка.Параметры.ПартнерВалюта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1, в валюте: %2'", ОбщегоНазначения.КодОсновногоЯзыка()), СтрокаЗадолженности.Партнер, ВыборкаДетальныхЗаписей.Валюта);
	ИначеЕсли ДанныеДокумента.РасшифровкаПоДоговорам Тогда 
		ОбластьМакетаГруппировка.Параметры.ПартнерВалюта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1, в валюте: %2'", ОбщегоНазначения.КодОсновногоЯзыка()), СтрокаЗадолженности.Договор, ВыборкаДетальныхЗаписей.Валюта);
	Иначе
		ОбластьМакетаГруппировка.Параметры.ПартнерВалюта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='в валюте: %1'", ОбщегоНазначения.КодОсновногоЯзыка()), ВыборкаДетальныхЗаписей.Валюта);
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьМакетаГруппировка);
	
	ОбластьМакетаШапка.Параметры.Заполнить(СтруктураПредставленийУчастников);
	ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
	
	ПредставленияДокументов = ПредставленияДокументов();
	ПредставленияВладельцевДокументов = ПредставленияВладельцевДокументов();
	
	ПредставлениеДокумента = "";
	ПредставлениеВладельцаДокумента = "";
	
	НачальныйОстаток = 0;
	КонечныйОстаток  = 0;
	
	ДетальныеЗаписи = ВыборкаДетальныхЗаписей.Выбрать();
	
	ПервыйПроход = Истина;
	Пока ДетальныеЗаписи.Следующий() Цикл
		
		Если ДетальныеЗаписи.Документ = Неопределено Тогда
			Если ДетальныеЗаписи.Период = ДанныеДокумента.НачалоПериода Тогда
				НачальныйОстаток = НачальныйОстаток + ДетальныеЗаписи.СуммаНачальныйОстаток;
			Иначе
				КонечныйОстаток = КонечныйОстаток + ДетальныеЗаписи.СуммаКонечныйОстаток;
			КонецЕсли;
		Иначе
			
			Если ПервыйПроход
				И ЗначениеЗаполнено(ДанныеДокумента.НачалоПериода) Тогда
				
				ОбластьМакетаНачОстаток.Параметры.НачалоПериодаСверки = Формат(ДанныеДокумента.НачалоПериода, "ДЛФ=ДД");
				Если НачальныйОстаток > 0 Тогда
					ОбластьМакетаНачОстаток.Параметры.СуммаНашДолг = 0;
					ОбластьМакетаНачОстаток.Параметры.СуммаДолгПартнера = НачальныйОстаток;
				Иначе
					ОбластьМакетаНачОстаток.Параметры.СуммаНашДолг = -НачальныйОстаток;
					ОбластьМакетаНачОстаток.Параметры.СуммаДолгПартнера = 0;
				КонецЕсли;				
				ТабличныйДокумент.Вывести(ОбластьМакетаНачОстаток);
				
			КонецЕсли;
			Документ = ДетальныеЗаписи.Документ; // ДокументСсылка
			ИмяДокумента = Документ.Метаданные().Имя;
			ПредставленияДокументов.Свойство(ИмяДокумента, ПредставлениеДокумента);
			ПредставленияВладельцевДокументов.Свойство(ИмяДокумента, ПредставлениеВладельцаДокумента);
			
			Если ЗначениеЗаполнено(ПредставлениеВладельцаДокумента) Тогда
				ПредставлениеВладельцаДокумента = ПредставлениеВладельцаДокумента + " " + ?(ДетальныеЗаписи.ЭтоВходящийДокумент,
					СтруктураПредставленийУчастников.КонтрагентНаименование,
					СтруктураПредставленийУчастников.ПредставлениеОрганизации);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДетальныеЗаписи.Номер) Тогда
				Если ИмяДокумента = "СписаниеБезналичныхДенежныхСредств" Тогда
					НомерНаПечать = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДетальныеЗаписи.Номер,, Истина);
				ИначеЕсли ДетальныеЗаписи.ЭтоВходящийДокумент Тогда
					НомерНаПечать = УбратьЛидирующиеНули(ДетальныеЗаписи.Номер);
				Иначе
					НомерНаПечать = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДетальныеЗаписи.Номер);
				КонецЕсли;
			Иначе
				НомерНаПечать = "_______";
			КонецЕсли;
			
			ОписаниеДокумента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='%1 №%2 от %3'", ОбщегоНазначения.КодОсновногоЯзыка()),
				?(ПредставлениеДокумента <> Неопределено, ПредставлениеДокумента, ""),
				НомерНаПечать,
				?(ЗначениеЗаполнено(ДетальныеЗаписи.ДатаВходящегоДокумента), Формат(ДетальныеЗаписи.ДатаВходящегоДокумента, "ДЛФ=D") + " " + НСтр("ru='г.'", ОбщегоНазначения.КодОсновногоЯзыка()), НСтр("ru='  .  .    '", ОбщегоНазначения.КодОсновногоЯзыка())));
			
			Если ЗначениеЗаполнено(ДетальныеЗаписи.ОрганизацияРеглУчет) Тогда
				
				СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДетальныеЗаписи.ОрганизацияРеглУчет, ДанныеДокумента.Дата);
				ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, 
					"ПолноеНаименование");
				
				ОписаниеДокумента = НСтр("ru='Перенос задолженности'");
				ПредставлениеВладельцаДокумента = НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()) + " " + ПредставлениеОрганизации;
				
			КонецЕсли;
			
			ОбластьМакетаСтрока.Параметры.Дата = Формат(ДетальныеЗаписи.Дата, "ДЛФ=D");
			ОбластьМакетаСтрока.Параметры.Документ = ОписаниеДокумента;
			ОбластьМакетаСтрока.Параметры.ОтКого = ПредставлениеВладельцаДокумента;
			ОбластьМакетаСтрока.Параметры.СуммаДолгПартнера = ДетальныеЗаписи.СуммаДолгПартнера;
			ОбластьМакетаСтрока.Параметры.СуммаНашДолг = ДетальныеЗаписи.СуммаНашДолг;
			ОбластьМакетаСтрока.Параметры.ДокументСсылка = ДетальныеЗаписи.Документ;
			ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);
			
			ПервыйПроход = Ложь;
			
		КонецЕсли;
	
	КонецЦикла; 
	
	Если ПервыйПроход
		И ЗначениеЗаполнено(ДанныеДокумента.НачалоПериода) Тогда
		
		ОбластьМакетаНачОстаток.Параметры.НачалоПериодаСверки = Формат(ДанныеДокумента.НачалоПериода, "ДЛФ=ДД");
		Если НачальныйОстаток > 0 Тогда
			ОбластьМакетаНачОстаток.Параметры.СуммаНашДолг = 0;
			ОбластьМакетаНачОстаток.Параметры.СуммаДолгПартнера = НачальныйОстаток;
		Иначе
			ОбластьМакетаНачОстаток.Параметры.СуммаНашДолг = -НачальныйОстаток;
			ОбластьМакетаНачОстаток.Параметры.СуммаДолгПартнера = 0;
		КонецЕсли;				
		ТабличныйДокумент.Вывести(ОбластьМакетаНачОстаток);
		
	КонецЕсли;
	
	ОбластьМакетаКонОстаток.Параметры.КонецПериодаСверки = Формат(ДанныеДокумента.КонецПериода, "ДЛФ=ДД");
	Если КонечныйОстаток > 0 Тогда
		ОбластьМакетаКонОстаток.Параметры.СуммаНашДолг = 0;
		ОбластьМакетаКонОстаток.Параметры.СуммаДолгПартнера = КонечныйОстаток;
	Иначе
		ОбластьМакетаКонОстаток.Параметры.СуммаНашДолг = -КонечныйОстаток;
		ОбластьМакетаКонОстаток.Параметры.СуммаДолгПартнера = 0;
	КонецЕсли;				
	ТабличныйДокумент.Вывести(ОбластьМакетаКонОстаток);
	
	Если КонечныйОстаток <> 0 Тогда
		СтрокаЗадолженности.Сумма = КонечныйОстаток;
	Иначе
		ТаблицаЗадолженности.Удалить(СтрокаЗадолженности);
	КонецЕсли; 
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ВывестиДетальныеЗаписи(
	ДанныеПоОбъектуГруппировки,
	ДанныеДокумента,
	Макет,
	ИтогоЗадолженность,
	НастройкиПечати)
	
	СтруктураПредставленийУчастников = НастройкиПечати.ПредставленияУчастников;
	
	ЭтоФинансовыеИнструменты = ДанныеПоОбъектуГруппировки.ФинансовыеИнструменты;
	ВыводитьДолгАванс = НЕ ЭтоФинансовыеИнструменты И НЕ НастройкиПечати.ДолгКакДебет;
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	#Область ОбластиПечати
	ОбластьМакетаГруппировка = Макет.ПолучитьОбласть("ГруппировкаОбъектДоговорВалюта");
	Если ЭтоФинансовыеИнструменты Тогда
		ОбластьМакетаШапка		= Макет.ПолучитьОбласть("ШапкаТаблицыФинИнструменты");
		ОбластьМакетаНачОстаток	= Макет.ПолучитьОбласть("СтрокаТаблицыНачОстатокФинИнструменты");
		ОбластьМакетаСтрока 		= Макет.ПолучитьОбласть("СтрокаТаблицыФинИнструменты");
		ОбластьМакетаОбороты 		= Макет.ПолучитьОбласть("ОборотыЗаПериодФинИнструменты");
		ОбластьМакетаКонОстаток	= Макет.ПолучитьОбласть("СтрокаТаблицыКонОстатокФинИнструменты");
		Если НастройкиПечати.НеЗаполнятьДанныеКонтрагента Тогда
			ОбластьМакетаНачОстаток.Область("СуммаКонтрагентНачОстатокФин").Формат = "ЧДЦ=2";
			ОбластьМакетаСтрока.Область("СуммаКонтрагентФин").Формат = "ЧДЦ=2";
			ОбластьМакетаОбороты.Область("СуммаКонтрагентОборотыФин").Формат = "ЧДЦ=2";
			ОбластьМакетаКонОстаток.Область("СуммаКонтрагентКонОстатокФин").Формат = "ЧДЦ=2";
		КонецЕсли;
	Иначе
		ОбластьМакетаШапка	 = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьМакетаНачОстаток  = Макет.ПолучитьОбласть("СтрокаТаблицыНачОстаток");
		ОбластьМакетаСтрока 	 = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ОбластьМакетаОбороты 	 = Макет.ПолучитьОбласть("ОборотыЗаПериод");
		ОбластьМакетаКонОстаток  = Макет.ПолучитьОбласть("СтрокаТаблицыКонОстаток");
		Если НастройкиПечати.НеЗаполнятьДанныеКонтрагента Тогда
			ОбластьМакетаНачОстаток.Область("СуммаКонтрагентНачОстаток").Формат = "ЧДЦ=2";
			ОбластьМакетаСтрока.Область("СуммаКонтрагент").Формат = "ЧДЦ=2";
			ОбластьМакетаОбороты.Область("СуммаКонтрагентОбороты").Формат = "ЧДЦ=2";
			ОбластьМакетаКонОстаток.Область("СуммаКонтрагентКонОстаток").Формат = "ЧДЦ=2";
		КонецЕсли;
	КонецЕсли;
	#КонецОбласти
	
	#Область ВыводНазванияГруппировки
	Валюта = СтрШаблон(НСтр("ru='в валюте'", ОбщегоНазначения.КодОсновногоЯзыка()) + " %1", ДанныеПоОбъектуГруппировки.Валюта);
	ШаблонЗаголовка = ДанныеПоОбъектуГруппировки.ПредставлениеТипРасчетов;
	Если НастройкиПечати.ДетализацияВзаиморасчетов = "ОбъектРасчетов"
		И (ДанныеПоОбъектуГруппировки.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом
			ИЛИ ДанныеПоОбъектуГруппировки.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком) Тогда
		ШаблонЗаголовка = ?(ШаблонЗаголовка = Неопределено, "", ШаблонЗаголовка + " ") + НСтр("ru = 'по объекту расчетов'", ОбщегоНазначения.КодОсновногоЯзыка()) + " %1 ";
	ИначеЕсли НастройкиПечати.ДетализацияВзаиморасчетов = "Договор" И НЕ ЭтоФинансовыеИнструменты
	 		ИЛИ НастройкиПечати.ДетализацияФинансовыхИнструментов = "Договор" И ЭтоФинансовыеИнструменты Тогда
		ШаблонЗаголовка = ?(ШаблонЗаголовка = Неопределено, "", ШаблонЗаголовка + " ") + НСтр("ru = 'по договору'", ОбщегоНазначения.КодОсновногоЯзыка()) + " %1 ";
	КонецЕсли;
	
	ТекстОбъектаГруппировки = "<" + НСтр("ru = 'не указан'", ОбщегоНазначения.КодОсновногоЯзыка()) + ">";
	Если ЗначениеЗаполнено(ДанныеПоОбъектуГруппировки.ПредставлениеОбъектГруппировки) Тогда
		ТекстОбъектаГруппировки = ДанныеПоОбъектуГруппировки.ПредставлениеОбъектГруппировки;
	КонецЕсли;
	
	ЗаголовокГруппировки = ?(ШаблонЗаголовка = Неопределено, "", ШаблонЗаголовка + " ") + Валюта;
	Если НастройкиПечати.ДетализацияВзаиморасчетов <> "Валюта" И НЕ ЭтоФинансовыеИнструменты
		ИЛИ НастройкиПечати.ДетализацияФинансовыхИнструментов <> "Валюта" И ЭтоФинансовыеИнструменты Тогда
		ШаблонЗаголовка = ?(ШаблонЗаголовка = Неопределено, "%1 ", ШаблонЗаголовка);
		ЗаголовокГруппировки = СтрШаблон(ШаблонЗаголовка, ТекстОбъектаГруппировки) + Валюта;
	КонецЕсли;
	ОбластьМакетаГруппировка.Параметры.ЗаголовокГруппировки = ЗаголовокГруппировки;
	ТабличныйДокумент.Вывести(ОбластьМакетаГруппировка);
	#КонецОбласти
	
	#Область ВыводШапкиТаблицы
	ОбластьМакетаШапка.Параметры.Заполнить(СтруктураПредставленийУчастников);
	ОбластьМакетаШапка.Параметры.Дебет = НСтр("ru = 'Долг'", ОбщегоНазначения.КодОсновногоЯзыка());
	ОбластьМакетаШапка.Параметры.Кредит = НСтр("ru = 'Аванс'", ОбщегоНазначения.КодОсновногоЯзыка());
	ОбластьМакетаНачОстаток.Параметры.ИмяОстатка = НСтр("ru = 'Начальный остаток'", ОбщегоНазначения.КодОсновногоЯзыка());
	ОбластьМакетаКонОстаток.Параметры.ИмяОстатка = НСтр("ru = 'Конечный остаток'", ОбщегоНазначения.КодОсновногоЯзыка());
	Если НастройкиПечати.ДолгКакДебет ИЛИ ЭтоФинансовыеИнструменты Тогда
		ОбластьМакетаШапка.Параметры.Дебет = НСтр("ru = 'Дебет'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОбластьМакетаШапка.Параметры.Кредит = НСтр("ru = 'Кредит'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОбластьМакетаНачОстаток.Параметры.ИмяОстатка = НСтр("ru = 'Сальдо начальное'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОбластьМакетаКонОстаток.Параметры.ИмяОстатка = НСтр("ru = 'Сальдо конечное'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
	#КонецОбласти
	
	#Область ВыводНачальногоОстатка
	ОбластьМакетаНачОстаток.Параметры.СуммаДебет = ДанныеПоОбъектуГруппировки.НачальноеСальдоДт;
	ОбластьМакетаНачОстаток.Параметры.СуммаКредит = ДанныеПоОбъектуГруппировки.НачальноеСальдоКт;
	
	ОбластьМакетаНачОстаток.Параметры.СуммаДебетКонтрагент = ДанныеПоОбъектуГруппировки.НачальноеСальдоКт;
	ОбластьМакетаНачОстаток.Параметры.СуммаКредитКонтрагент = ДанныеПоОбъектуГруппировки.НачальноеСальдоДт;
	Если ВыводитьДолгАванс Тогда
		ОчиститьДебетКредит(ОбластьМакетаНачОстаток);
		Если ДанныеПоОбъектуГруппировки.НачальноеСальдо > 0 Тогда
			ОбластьМакетаНачОстаток.Параметры.СуммаДебет = ДанныеПоОбъектуГруппировки.НачальноеСальдо;
			ОбластьМакетаНачОстаток.Параметры.СуммаДебетКонтрагент = ДанныеПоОбъектуГруппировки.НачальноеСальдо;
		Иначе
			ОбластьМакетаНачОстаток.Параметры.СуммаКредит = -ДанныеПоОбъектуГруппировки.НачальноеСальдо;
			ОбластьМакетаНачОстаток.Параметры.СуммаКредитКонтрагент = -ДанныеПоОбъектуГруппировки.НачальноеСальдо;
		КонецЕсли;
	КонецЕсли;
	Если НастройкиПечати.НеЗаполнятьДанныеКонтрагента Тогда
		ОбластьМакетаНачОстаток.Параметры.СуммаДебетКонтрагент = 0;
		ОбластьМакетаНачОстаток.Параметры.СуммаКредитКонтрагент = 0;
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьМакетаНачОстаток);
	#КонецОбласти
	
	ОборотАктивКонтрагент = Новый Структура("СуммаДебетКонтрагент, СуммаКредитКонтрагент", 0, 0);
	ОборотПассивКонтрагент = Новый Структура("СуммаДебетКонтрагент, СуммаКредитКонтрагент", 0, 0);
	РасчетныеДокументыПериода = Новый Массив;
	Обороты = Новый Структура("Долг,Аванс,Дебет,Кредит",0,0,0,0);
	Если ДанныеПоОбъектуГруппировки.ЕстьОбороты Тогда
		Для Каждого ДетальныеЗаписи Из ДанныеПоОбъектуГруппировки.Строки Цикл
			
			Если ТипЗнч(ДетальныеЗаписи.РасчетныйДокумент) = Тип("ДокументСсылка.ВзаимозачетЗадолженности")
				И ДетальныеЗаписи.СуммаДебет - ДетальныеЗаписи.СуммаКредит = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			РасчетныеДокументыПериода.Добавить(ДетальныеЗаписи.РасчетныйДокумент);
			
			Если ЭтоФинансовыеИнструменты Тогда
				ОбластьМакетаСтрока = Макет.ПолучитьОбласть("СтрокаТаблицыФинИнструменты");
				Если НастройкиПечати.НеЗаполнятьДанныеКонтрагента Тогда
					ОбластьМакетаСтрока.Область("СуммаКонтрагентФин").Формат = "ЧДЦ=2";
				КонецЕсли;
			Иначе
				ОбластьМакетаСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
				Если НастройкиПечати.НеЗаполнятьДанныеКонтрагента Тогда
					ОбластьМакетаСтрока.Область("СуммаКонтрагент").Формат = "ЧДЦ=2";
				КонецЕсли;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ОбластьМакетаСтрока.Параметры, ДетальныеЗаписи);
			ОбластьМакетаСтрока.Параметры.Дата = Формат(ДетальныеЗаписи.ДатаДокумента, "ДЛФ=D");
			Обороты.Дебет = Обороты.Дебет + ДетальныеЗаписи.СуммаДебет;
			Обороты.Кредит = Обороты.Кредит + ДетальныеЗаписи.СуммаКредит;
			Если ВыводитьДолгАванс Тогда
				ОчиститьДебетКредит(ОбластьМакетаСтрока);
				ОбластьМакетаСтрока.Параметры.СуммаДебет = ДетальныеЗаписи.СуммаДолг;
				ОбластьМакетаСтрока.Параметры.СуммаКредит = ДетальныеЗаписи.СуммаАванс;
				ОбластьМакетаСтрока.Параметры.СуммаДебетКонтрагент = ДетальныеЗаписи.СуммаДолгКонтрагент;
				ОбластьМакетаСтрока.Параметры.СуммаКредитКонтрагент = ДетальныеЗаписи.СуммаАвансКонтрагент;
				Обороты.Долг = Обороты.Долг + ДетальныеЗаписи.СуммаДолг;
				Обороты.Аванс = Обороты.Аванс + ДетальныеЗаписи.СуммаАванс;
			КонецЕсли;
			Если НастройкиПечати.НеЗаполнятьДанныеКонтрагента Тогда
				Если НЕ ЭтоФинансовыеИнструменты Тогда
					ОбластьМакетаСтрока.Параметры.СуммаДокументаКонтрагент = 0;
				КонецЕсли;
				ОбластьМакетаСтрока.Параметры.СуммаДебетКонтрагент = 0;
				ОбластьМакетаСтрока.Параметры.СуммаКредитКонтрагент = 0;
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);
				
			Если ДетальныеЗаписи.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком
				ИЛИ ДетальныеЗаписи.ТипРасчетов = НЕОПРЕДЕЛЕНО
				ИЛИ ДетальныеЗаписи.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКредитором Тогда
				ДобавитьОборотКонтрагента(ОборотАктивКонтрагент, ДетальныеЗаписи, ВыводитьДолгАванс);
				
			ИначеЕсли ДетальныеЗаписи.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом
				ИЛИ ДетальныеЗаписи.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСДебитором Тогда
				ДобавитьОборотКонтрагента(ОборотПассивКонтрагент, ДетальныеЗаписи, ВыводитьДолгАванс);
				
			КонецЕсли;
		
		КонецЦикла; 
	КонецЕсли;
	
	#Область ВыводОборотовЗаПериод
	ЗаполнитьЗначенияСвойств(ОбластьМакетаОбороты.Параметры, ДанныеПоОбъектуГруппировки);
	ОбластьМакетаОбороты.Параметры.СуммаДебет = Обороты.Дебет;
	ОбластьМакетаОбороты.Параметры.СуммаКредит = Обороты.Кредит;
	Если ВыводитьДолгАванс Тогда
		ОчиститьДебетКредит(ОбластьМакетаОбороты);
		ОбластьМакетаОбороты.Параметры.СуммаДебет = Обороты.Долг;
		ОбластьМакетаОбороты.Параметры.СуммаКредит = Обороты.Аванс;
	КонецЕсли;
	Если ДанныеПоОбъектуГруппировки.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком
			ИЛИ ДанныеПоОбъектуГруппировки.ТипРасчетов = Неопределено Тогда
		ОбластьМакетаОбороты.Параметры.СуммаДебетКонтрагент = ОборотАктивКонтрагент.СуммаДебетКонтрагент;
		ОбластьМакетаОбороты.Параметры.СуммаКредитКонтрагент = ОборотАктивКонтрагент.СуммаКредитКонтрагент;
	ИначеЕсли ДанныеПоОбъектуГруппировки.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСЛизингодателем
		ИЛИ ДанныеПоОбъектуГруппировки.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКредитором Тогда
		ОбластьМакетаОбороты.Параметры.СуммаДебетКонтрагент = ОборотАктивКонтрагент.СуммаДебетКонтрагент + ОборотПассивКонтрагент.СуммаДебетКонтрагент;
		ОбластьМакетаОбороты.Параметры.СуммаКредитКонтрагент = ОборотАктивКонтрагент.СуммаКредитКонтрагент + ОборотПассивКонтрагент.СуммаКредитКонтрагент;
	Иначе
		ОбластьМакетаОбороты.Параметры.СуммаДебетКонтрагент = ОборотПассивКонтрагент.СуммаДебетКонтрагент;
		ОбластьМакетаОбороты.Параметры.СуммаКредитКонтрагент = ОборотПассивКонтрагент.СуммаКредитКонтрагент;
	КонецЕсли;
	Если НастройкиПечати.НеЗаполнятьДанныеКонтрагента Тогда
		ОбластьМакетаОбороты.Параметры.СуммаДебетКонтрагент = 0;
		ОбластьМакетаОбороты.Параметры.СуммаКредитКонтрагент = 0;
	КонецЕсли;
	Если РасчетныеДокументыПериода.Количество() > 0 Тогда
		ТабличныйДокумент.Вывести(ОбластьМакетаОбороты);
	КонецЕсли;
	#КонецОбласти
	
	#Область ВыводКонечногоОстатка
	ЗаполнитьЗначенияСвойств(ОбластьМакетаКонОстаток.Параметры, ДанныеПоОбъектуГруппировки);
	Если ДанныеПоОбъектуГруппировки.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСЛизингодателем Тогда
		Если ДанныеПоОбъектуГруппировки.КонечноеСальдоДт > 0 И ДанныеПоОбъектуГруппировки.КонечноеСальдоКт > 0 Тогда
			КонечноеСальдо(ДанныеПоОбъектуГруппировки.КонечноеСальдоДт, ДанныеПоОбъектуГруппировки.КонечноеСальдоКт);
		КонецЕсли;
	КонецЕсли;
	ОбластьМакетаКонОстаток.Параметры.СуммаДебет = ДанныеПоОбъектуГруппировки.КонечноеСальдоДт;
	ОбластьМакетаКонОстаток.Параметры.СуммаКредит = ДанныеПоОбъектуГруппировки.КонечноеСальдоКт;
	
	ОбластьМакетаКонОстаток.Параметры.СуммаДебетКонтрагент = 0;
	ОбластьМакетаКонОстаток.Параметры.СуммаКредитКонтрагент = 0;
	
	НачальноеСальдоКонтрагентДт = ДанныеПоОбъектуГруппировки.НачальноеСальдоКт;
	НачальноеСальдоКонтрагентКт = ДанныеПоОбъектуГруппировки.НачальноеСальдоДт;
	КонечноеСальдоКонтрагентДт = НачальноеСальдоКонтрагентДт + ОборотАктивКонтрагент.СуммаДебетКонтрагент - ОборотАктивКонтрагент.СуммаКредитКонтрагент;
	КонечноеСальдоКонтрагентКт = НачальноеСальдоКонтрагентКт - ОборотПассивКонтрагент.СуммаДебетКонтрагент + ОборотПассивКонтрагент.СуммаКредитКонтрагент;
	
	Если ДанныеПоОбъектуГруппировки.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСЛизингодателем Тогда
		Если КонечноеСальдоКонтрагентДт < 0 Тогда
			КонечноеСальдоКонтрагентКт = КонечноеСальдоКонтрагентКт - КонечноеСальдоКонтрагентДт;
			КонечноеСальдоКонтрагентДт = 0;
		КонецЕсли;
		Если КонечноеСальдоКонтрагентКт < 0 Тогда
			КонечноеСальдоКонтрагентДт = КонечноеСальдоКонтрагентДт - КонечноеСальдоКонтрагентКт;
			КонечноеСальдоКонтрагентКт = 0;
		КонецЕсли;
		Если КонечноеСальдоКонтрагентДт > 0 И КонечноеСальдоКонтрагентКт > 0 Тогда
			КонечноеСальдо(КонечноеСальдоКонтрагентДт, КонечноеСальдоКонтрагентКт);
		КонецЕсли;
	Иначе
		КонечноеСальдо(КонечноеСальдоКонтрагентДт, КонечноеСальдоКонтрагентКт);
	КонецЕсли;
	
	ОбластьМакетаКонОстаток.Параметры.СуммаДебетКонтрагент = КонечноеСальдоКонтрагентДт;
	ОбластьМакетаКонОстаток.Параметры.СуммаКредитКонтрагент = КонечноеСальдоКонтрагентКт;
	Если ВыводитьДолгАванс Тогда
		ОчиститьДебетКредит(ОбластьМакетаКонОстаток);
		Если ДанныеПоОбъектуГруппировки.КонечноеСальдо > 0 Тогда
			ОбластьМакетаКонОстаток.Параметры.СуммаДебет = ДанныеПоОбъектуГруппировки.КонечноеСальдо;
		Иначе
			ОбластьМакетаКонОстаток.Параметры.СуммаКредит = -ДанныеПоОбъектуГруппировки.КонечноеСальдо;
		КонецЕсли;
		
		КонечныйОстатокКонтрагент = ДанныеПоОбъектуГруппировки.НачальноеСальдо
								+ ДанныеПоОбъектуГруппировки.СуммаДолгКонтрагент
								- ДанныеПоОбъектуГруппировки.СуммаАвансКонтрагент;
		
		Если КонечныйОстатокКонтрагент > 0 Тогда
			ОбластьМакетаКонОстаток.Параметры.СуммаДебетКонтрагент = КонечныйОстатокКонтрагент;
		Иначе
			ОбластьМакетаКонОстаток.Параметры.СуммаКредитКонтрагент = -КонечныйОстатокКонтрагент;
		КонецЕсли;
	КонецЕсли;
	Если НастройкиПечати.НеЗаполнятьДанныеКонтрагента Тогда
		ОбластьМакетаКонОстаток.Параметры.СуммаДебетКонтрагент = 0;
		ОбластьМакетаКонОстаток.Параметры.СуммаКредитКонтрагент = 0;
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьМакетаКонОстаток);
	#КонецОбласти

	Задолженность = ИтогоЗадолженность.Добавить();
	Задолженность.Валюта = ДанныеПоОбъектуГруппировки.Валюта;
	Задолженность.СуммаДт = ДанныеПоОбъектуГруппировки.КонечноеСальдоДт;
	Задолженность.СуммаКт = ДанныеПоОбъектуГруппировки.КонечноеСальдоКт;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура РассчитатьСальдо(ДолгВВалюте, Сумма)
	
	СуммаДт = ДолгВВалюте[Сумма + "Дт"];
	СуммаКт = ДолгВВалюте[Сумма + "Кт"];
	Сальдо = Суммадт - СуммаКт;
	Если Сальдо > 0 Тогда
		ДолгВВалюте[Сумма + "Дт"] = Сальдо;
		ДолгВВалюте[Сумма + "Кт"] = 0;
	Иначе
		ДолгВВалюте[Сумма + "Дт"] = 0;
		ДолгВВалюте[Сумма + "Кт"] = -Сальдо;
	КонецЕсли;
	
КонецПроцедуры

Процедура РасшифроватьНастройкуДетализации(НастройкиПечати)
	
	ГруппировкаРасчетов = Новый Массив;
	ГруппировкаРасчетов.Добавить("Валюта");
	ГруппировкаРасчетов.Добавить("Договор");
	ГруппировкаРасчетов.Добавить("ОбъектРасчетов");
	
	ГруппировкаФинИнструментов = Новый Массив;
	ГруппировкаФинИнструментов.Добавить("Валюта");
	ГруппировкаФинИнструментов.Добавить("Договор");
	
	НастройкиПечати.ДетализацияВзаиморасчетов = ГруппировкаРасчетов[НастройкиПечати.ДетализацияВзаиморасчетов];
	НастройкиПечати.ДетализацияФинансовыхИнструментов = ГруппировкаФинИнструментов[НастройкиПечати.ДетализацияФинансовыхИнструментов];
	
КонецПроцедуры

Функция ИнициализироватьМенеджерТаблиц(МассивОбъектов)
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Если ЗначениеЗаполнено(МассивОбъектов) Тогда
		ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);
	Иначе
		ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(Документы.СверкаВзаиморасчетов.ПустаяСсылка(), МенеджерВременныхТаблиц);	
	КонецЕсли;
	
	Возврат МенеджерВременныхТаблиц;
	
КонецФункции

Функция ТекстЗапросаДанныеДокумента(НастройкиПечати)
	
	#Область ТекстЗапроса
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТЧГруппировкиРасчетов.Ссылка КАК Ссылка,
	|	ТЧГруппировкиРасчетов.ТипРасчетов КАК ТипРасчетов,
	|	ТЧГруппировкиРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ТЧГруппировкиРасчетов.Договор КАК Договор,
	|	ВЫБОР КОГДА &ВыводитьВВалютеРегл ТОГДА &ВалютаРегл ИНАЧЕ ТЧГруппировкиРасчетов.Валюта КОНЕЦ КАК Валюта,
	|	СУММА(ВЫБОР КОГДА &ВыводитьВВалютеРегл ТОГДА ТЧГруппировкиРасчетов.НачальноеСальдоРегл ИНАЧЕ ТЧГруппировкиРасчетов.НачальноеСальдо КОНЕЦ) КАК НачальноеСальдо,
	|	СУММА(ВЫБОР КОГДА &ВыводитьВВалютеРегл ТОГДА ТЧГруппировкиРасчетов.ОборотПриходРегл ИНАЧЕ ТЧГруппировкиРасчетов.ОборотПриход КОНЕЦ) КАК ОборотПриход,
	|	СУММА(ВЫБОР КОГДА &ВыводитьВВалютеРегл ТОГДА ТЧГруппировкиРасчетов.ОборотРасходРегл ИНАЧЕ ТЧГруппировкиРасчетов.ОборотРасход КОНЕЦ) КАК ОборотРасход,
	|	СУММА(ВЫБОР КОГДА &ВыводитьВВалютеРегл ТОГДА ТЧГруппировкиРасчетов.КонечноеСальдоРегл ИНАЧЕ ТЧГруппировкиРасчетов.КонечноеСальдо КОНЕЦ) КАК КонечноеСальдо
	|ПОМЕСТИТЬ ТЧГруппировкиРасчетов
	|ИЗ
	|	Документ.СверкаВзаиморасчетов.ГруппировкиРасчеты КАК ТЧГруппировкиРасчетов
	|ГДЕ
	|	ТЧГруппировкиРасчетов.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧГруппировкиРасчетов.Ссылка,
	|	ТЧГруппировкиРасчетов.ТипРасчетов,
	|	ТЧГруппировкиРасчетов.ОбъектРасчетов,
	|	ТЧГруппировкиРасчетов.Договор,
	|	ВЫБОР КОГДА &ВыводитьВВалютеРегл ТОГДА &ВалютаРегл ИНАЧЕ ТЧГруппировкиРасчетов.Валюта КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧГруппировкиРасчетов.Ссылка КАК Ссылка,
	|	НЕОПРЕДЕЛЕНО КАК ТипРасчетов,
	|	ТЧГруппировкиРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ТЧГруппировкиРасчетов.Договор КАК Договор,
	|	ТЧГруппировкиРасчетов.Валюта КАК Валюта,
	|	СУММА(ВЫБОР КОГДА ТЧГруппировкиРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
	|		ТОГДА
	|			-ТЧГруппировкиРасчетов.НачальноеСальдо
	|		ИНАЧЕ
	|			ТЧГруппировкиРасчетов.НачальноеСальдо
	|	КОНЕЦ) КАК НачальноеСальдо,
	|	СУММА(ТЧГруппировкиРасчетов.ОборотПриход) КАК ОборотПриход,
	|	СУММА(ТЧГруппировкиРасчетов.ОборотРасход) КАК ОборотРасход,
	|	СУММА(ВЫБОР КОГДА ТЧГруппировкиРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
	|		ТОГДА
	|			-ТЧГруппировкиРасчетов.КонечноеСальдо
	|		ИНАЧЕ
	|			ТЧГруппировкиРасчетов.КонечноеСальдо
	|	КОНЕЦ) КАК КонечноеСальдо
	|ПОМЕСТИТЬ ТЧГруппировкиПоВсемТипамРасчетов
	|ИЗ
	|	ТЧГруппировкиРасчетов КАК ТЧГруппировкиРасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧГруппировкиРасчетов.Ссылка,
	|	ТЧГруппировкиРасчетов.ОбъектРасчетов,
	|	ТЧГруппировкиРасчетов.Договор,
	|	ТЧГруппировкиРасчетов.Валюта
	|	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧГруппировкиРасчеты.Ссылка КАК ДокументСсылка,
	|	ТЧГруппировкиРасчеты.Ссылка.ЕстьРасхождения КАК ЕстьРасхождения,
	|	ТЧГруппировкиРасчеты.ТипРасчетов КАК ТипРасчетов,
	|	ТЧГруппировкиРасчеты.Договор КАК Договор,
	|	ТЧДетальныеЗаписиРасчеты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ТЧДетальныеЗаписиРасчеты.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ТЧДетальныеЗаписиРасчеты.ОписаниеДокумента КАК ОписаниеДокумента,
	|	ТЧГруппировкиРасчеты.Валюта КАК Валюта,
	|	ТЧДетальныеЗаписиРасчеты.ВалютаДокумента КАК ВалютаДокумента,
	|	
	|	ТЧДетальныеЗаписиРасчеты.СуммаДокумента КАК СуммаДокумента,
	|	ВЫБОР
	|		КОГДА ТЧДетальныеЗаписиРасчеты.Ссылка.ЕстьРасхождения
	|			ТОГДА 
	|				ТЧДетальныеЗаписиРасчеты.СуммаДокументаКонтрагент
	|		ИНАЧЕ 
	|			ТЧДетальныеЗаписиРасчеты.СуммаДокумента
	|	КОНЕЦ КАК СуммаДокументаКонтрагент,
	|	ВЫБОР КОГДА &ВыводитьВВалютеРегл ТОГДА ТЧДетальныеЗаписиРасчеты.СуммаДолгРегл ИНАЧЕ ТЧДетальныеЗаписиРасчеты.СуммаДолг КОНЕЦ КАК СуммаДолг,
	|	ВЫБОР КОГДА &ВыводитьВВалютеРегл ТОГДА ТЧДетальныеЗаписиРасчеты.СуммаАвансРегл ИНАЧЕ ТЧДетальныеЗаписиРасчеты.СуммаАванс КОНЕЦ КАК СуммаАванс,
	|	ТЧДетальныеЗаписиРасчеты.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА ТЧДетальныеЗаписиРасчеты.Ссылка.ЕстьРасхождения
	|			ТОГДА 
	|				ТЧДетальныеЗаписиРасчеты.СуммаДолгКонтрагент
	|		ИНАЧЕ 
	|			ВЫБОР КОГДА &ВыводитьВВалютеРегл ТОГДА ТЧДетальныеЗаписиРасчеты.СуммаДолгРегл ИНАЧЕ ТЧДетальныеЗаписиРасчеты.СуммаДолг КОНЕЦ
	|	КОНЕЦ КАК СуммаДолгКонтрагент,
	|	ВЫБОР
	| 		КОГДА ТЧДетальныеЗаписиРасчеты.Ссылка.ЕстьРасхождения
	|			ТОГДА 
	|				ТЧДетальныеЗаписиРасчеты.СуммаАвансКонтрагент
	|		ИНАЧЕ 
	|			ВЫБОР КОГДА &ВыводитьВВалютеРегл ТОГДА ТЧДетальныеЗаписиРасчеты.СуммаАвансРегл ИНАЧЕ ТЧДетальныеЗаписиРасчеты.СуммаАванс КОНЕЦ
	|	КОНЕЦ КАК СуммаАвансКонтрагент,
	|	ВЫБОР
	|		КОГДА ТЧДетальныеЗаписиРасчеты.Ссылка.ЕстьРасхождения
	|			ТОГДА 
	|				ТЧДетальныеЗаписиРасчеты.СуммаВзаиморасчетовКонтрагент
	|		ИНАЧЕ 
	|			ТЧДетальныеЗаписиРасчеты.СуммаВзаиморасчетов
	|	КОНЕЦ  КАК СуммаВзаиморасчетовКонтрагент
	|
	|ПОМЕСТИТЬ ДетальныеЗаписиРасчетов
	|ИЗ
	|	ТЧГруппировкиРасчетов КАК ТЧГруппировкиРасчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СверкаВзаиморасчетов.ДетальныеЗаписиРасчеты КАК ТЧДетальныеЗаписиРасчеты
	|		ПО ТЧГруппировкиРасчеты.Ссылка = ТЧДетальныеЗаписиРасчеты.Ссылка
	|			И ТЧГруппировкиРасчеты.ОбъектРасчетов = ТЧДетальныеЗаписиРасчеты.ОбъектРасчетов
	|ГДЕ
	|	ТЧДетальныеЗаписиРасчеты.Ссылка В(&МассивОбъектов)
	|	И (&ВыводитьВВалютеРегл 
	|		ИЛИ НЕ &ВыводитьВВалютеРегл И (ТЧДетальныеЗаписиРасчеты.СуммаДолг <> 0 ИЛИ ТЧДетальныеЗаписиРасчеты.СуммаАванс <> 0))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГруппировкаРасчетов.Ссылка КАК ДокументСсылка,
	|	ГруппировкаРасчетов.ТипРасчетов КАК ТипРасчетов,
	|	ГруппировкаРасчетов.Договор КАК ОбъектГруппировки,
	|	ГруппировкаРасчетов.Валюта КАК Валюта,
	|	СУММА(ГруппировкаРасчетов.НачальноеСальдо) КАК НачальноеСальдо,
	|	СУММА(ГруппировкаРасчетов.ОборотПриход) КАК ОборотПриход,
	|	СУММА(ГруппировкаРасчетов.ОборотРасход) КАК ОборотРасход,
	|	СУММА(ГруппировкаРасчетов.КонечноеСальдо) КАК КонечноеСальдо
	|ПОМЕСТИТЬ втГруппировкиРасчетов
	|ИЗ
	|	ТЧГруппировкиРасчетов КАК ГруппировкаРасчетов
	|ГДЕ
	|	НЕ &ОбъединитьКлиентовПоставщиков
	|
	|СГРУППИРОВАТЬ ПО
	|	ГруппировкаРасчетов.Ссылка,
	|	ГруппировкаРасчетов.ТипРасчетов,
	|	ГруппировкаРасчетов.Договор,
	|	ГруппировкаРасчетов.Валюта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГруппировкаРасчетов.Ссылка КАК ДокументСсылка,
	|	ГруппировкаРасчетов.ТипРасчетов КАК ТипРасчетов,
	|	ГруппировкаРасчетов.Договор КАК ОбъектГруппировки,
	|	ГруппировкаРасчетов.Валюта КАК Валюта,
	|	СУММА(ГруппировкаРасчетов.НачальноеСальдо) КАК НачальноеСальдо,
	|	СУММА(ГруппировкаРасчетов.ОборотПриход) КАК ОборотПриход,
	|	СУММА(ГруппировкаРасчетов.ОборотРасход) КАК ОборотРасход,
	|	СУММА(ГруппировкаРасчетов.КонечноеСальдо) КАК КонечноеСальдо
	|ИЗ
	|	ТЧГруппировкиПоВсемТипамРасчетов КАК ГруппировкаРасчетов
	|ГДЕ
	|	&ОбъединитьКлиентовПоставщиков
	|
	|СГРУППИРОВАТЬ ПО
	|	ГруппировкаРасчетов.Ссылка,
	|	ГруппировкаРасчетов.ТипРасчетов,
	|	ГруппировкаРасчетов.Договор,
	|	ГруппировкаРасчетов.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Группировки.ДокументСсылка КАК ДокументСсылка,
	|	Группировки.ТипРасчетов КАК ТипРасчетов,
	|	ДетальныеЗаписиРасчетов.ТипРасчетов КАК ТипРасчетов2,
	|	Группировки.ОбъектГруппировки КАК ОбъектГруппировки,
	|	ПредставлениеСсылки(Группировки.ОбъектГруппировки) КАК ПредставлениеОбъектГруппировки,
	|	
	|	Группировки.НачальноеСальдо КАК НачальноеСальдо,
	|	ВЫБОР
	|		КОГДА (Группировки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
	|					ИЛИ Группировки.ТипРасчетов = НЕОПРЕДЕЛЕНО)
	|				И Группировки.НачальноеСальдо > 0
	|			ТОГДА 
	|				Группировки.НачальноеСальдо
	|			
	|		КОГДА Группировки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
	|				И Группировки.НачальноеСальдо < 0
	|			ТОГДА 
	|				-Группировки.НачальноеСальдо
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК НачальноеСальдоДт,
	|	ВЫБОР
	|		КОГДА (Группировки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
	|					ИЛИ Группировки.ТипРасчетов = НЕОПРЕДЕЛЕНО)
	|				И Группировки.НачальноеСальдо < 0
	|			ТОГДА 
	|				-Группировки.НачальноеСальдо
	|			
	|		КОГДА Группировки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
	|				И Группировки.НачальноеСальдо > 0
	|			ТОГДА 
	|				Группировки.НачальноеСальдо
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК НачальноеСальдоКт,
	|	Группировки.ОборотПриход КАК ОборотПриход,
	|	Группировки.ОборотРасход КАК ОборотРасход,
	|	Группировки.КонечноеСальдо КАК КонечноеСальдо,
	|	ВЫБОР
	|		КОГДА (Группировки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
	|					ИЛИ Группировки.ТипРасчетов = НЕОПРЕДЕЛЕНО)
	|				И Группировки.КонечноеСальдо > 0
	|			ТОГДА 
	|				Группировки.КонечноеСальдо
	|			
	|		КОГДА Группировки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
	|				И Группировки.КонечноеСальдо < 0
	|			ТОГДА 
	|				-Группировки.КонечноеСальдо
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК КонечноеСальдоДт,
	|	ВЫБОР
	|		КОГДА (Группировки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
	|					ИЛИ Группировки.ТипРасчетов = НЕОПРЕДЕЛЕНО)
	|				И Группировки.КонечноеСальдо < 0
	|			ТОГДА 
	|				-Группировки.КонечноеСальдо
	|			
	|		КОГДА Группировки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
	|				И Группировки.КонечноеСальдо > 0
	|			ТОГДА 
	|				Группировки.КонечноеСальдо
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК КонечноеСальдоКт,
	|	
	|	НЕ ДетальныеЗаписиРасчетов.РасчетныйДокумент ЕСТЬ NULL КАК ЕстьОбороты,
	|	ДетальныеЗаписиРасчетов.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДетальныеЗаписиРасчетов.ОписаниеДокумента КАК ОписаниеДокумента,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ДетальныеЗаписиРасчетов.РасчетныйДокумент) = ТИП(Документ.РасчетКурсовыхРазниц)
	|		ТОГДА &ВалютаРегл
	|		ИНАЧЕ Группировки.Валюта
	|	КОНЕЦ КАК Валюта,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ДетальныеЗаписиРасчетов.РасчетныйДокумент) = ТИП(Документ.РасчетКурсовыхРазниц)
	|		ТОГДА &ВалютаРегл
	|		ИНАЧЕ ДетальныеЗаписиРасчетов.ВалютаДокумента
	|	КОНЕЦ КАК ВалютаДокумента,
	|
	|	ВЫБОР
	|		КОГДА ДетальныеЗаписиРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
	|			ТОГДА
	|				ВЫБОР КОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаДолг, 0) > 0 ТОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаДолг, 0) ИНАЧЕ 0 КОНЕЦ
	|				+ ВЫБОР КОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаАванс, 0) < 0 ТОГДА -ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаАванс, 0) ИНАЧЕ 0 КОНЕЦ
	|		
	|		КОГДА ДетальныеЗаписиРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
	|				ИЛИ ДетальныеЗаписиРасчетов.ТипРасчетов = НЕОПРЕДЕЛЕНО
	|			ТОГДА
	|				ВЫБОР КОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаДолг, 0) < 0 ТОГДА -ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаДолг, 0) ИНАЧЕ 0 КОНЕЦ
	|				+ ВЫБОР КОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаАванс, 0) > 0 ТОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаАванс, 0) ИНАЧЕ 0 КОНЕЦ
	|
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДебет,
	| 	ВЫБОР
	|		КОГДА ДетальныеЗаписиРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
	|			ТОГДА
	|				ВЫБОР КОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаДолг, 0) < 0 ТОГДА -ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаДолг, 0) ИНАЧЕ 0 КОНЕЦ
	|				+ ВЫБОР КОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаАванс, 0) > 0 ТОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаАванс, 0) ИНАЧЕ 0 КОНЕЦ
	|		
	|		КОГДА ДетальныеЗаписиРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
	|				ИЛИ ДетальныеЗаписиРасчетов.ТипРасчетов = НЕОПРЕДЕЛЕНО
	|			ТОГДА
	|				ВЫБОР КОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаДолг, 0) > 0 ТОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаДолг, 0) ИНАЧЕ 0 КОНЕЦ
	|				+ ВЫБОР КОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаАванс, 0) < 0 ТОГДА -ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаАванс, 0) ИНАЧЕ 0 КОНЕЦ
	|				
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаКредит,
	|
	|	// У контрагента Дебетом является наш Кредит, а Кредитом наш Дебет
	|	ВЫБОР
	|		КОГДА ДетальныеЗаписиРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
	|			ТОГДА
	|				ВЫБОР КОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаДолгКонтрагент, 0) < 0 ТОГДА -ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаДолгКонтрагент, 0) ИНАЧЕ 0 КОНЕЦ
	|				+ ВЫБОР КОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаАвансКонтрагент, 0) > 0 ТОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаАвансКонтрагент, 0) ИНАЧЕ 0 КОНЕЦ
	|		
	|		КОГДА ДетальныеЗаписиРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
	|				ИЛИ ДетальныеЗаписиРасчетов.ТипРасчетов = НЕОПРЕДЕЛЕНО
	|			ТОГДА
	|				ВЫБОР КОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаДолгКонтрагент, 0) > 0 ТОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаДолгКонтрагент, 0) ИНАЧЕ 0 КОНЕЦ
	|				+ ВЫБОР КОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаАвансКонтрагент, 0) < 0 ТОГДА -ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаАвансКонтрагент, 0) ИНАЧЕ 0 КОНЕЦ
	|				
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДебетКонтрагент,
	|	ВЫБОР
	|		КОГДА ДетальныеЗаписиРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
	|			ТОГДА
	|				ВЫБОР КОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаДолгКонтрагент, 0) > 0 ТОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаДолгКонтрагент, 0) ИНАЧЕ 0 КОНЕЦ
	|				+ ВЫБОР КОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаАвансКонтрагент, 0) < 0 ТОГДА -ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаАвансКонтрагент, 0) ИНАЧЕ 0 КОНЕЦ
	|		
	|		КОГДА ДетальныеЗаписиРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
	|				ИЛИ ДетальныеЗаписиРасчетов.ТипРасчетов = НЕОПРЕДЕЛЕНО
	|			ТОГДА
	|				ВЫБОР КОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаДолгКонтрагент, 0) < 0 ТОГДА -ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаДолгКонтрагент, 0) ИНАЧЕ 0 КОНЕЦ
	|				+ ВЫБОР КОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаАвансКонтрагент, 0) > 0 ТОГДА ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаАвансКонтрагент, 0) ИНАЧЕ 0 КОНЕЦ
	|
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаКредитКонтрагент,
	|
	|	ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаДокумента, 0) КАК СуммаДокумента,
	|	ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаДокументаКонтрагент, 0) КАК СуммаДокументаКонтрагент,
	|	ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаДолг, 0) КАК СуммаДолг,
	|	ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаАванс, 0) КАК СуммаАванс,
	|	ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаВзаиморасчетов, 0) КАК СуммаВзаиморасчетов,
	|	ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаДолгКонтрагент, 0) КАК СуммаДолгКонтрагент,
	|	ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаАвансКонтрагент, 0) КАК СуммаАвансКонтрагент,
	|	ЕСТЬNULL(ДетальныеЗаписиРасчетов.СуммаВзаиморасчетовКонтрагент, 0) КАК СуммаВзаиморасчетовКонтрагент
	|	
	|ПОМЕСТИТЬ ДеталиРасчетов
	|ИЗ
	|	втГруппировкиРасчетов КАК Группировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДетальныеЗаписиРасчетов КАК ДетальныеЗаписиРасчетов
	|		ПО Группировки.ДокументСсылка = ДетальныеЗаписиРасчетов.ДокументСсылка
	|			И (Группировки.ТипРасчетов = ДетальныеЗаписиРасчетов.ТипРасчетов ИЛИ &ОбъединитьКлиентовПоставщиков)
	|			И Группировки.Валюта = ДетальныеЗаписиРасчетов.Валюта
	|			И Группировки.ОбъектГруппировки = ДетальныеЗаписиРасчетов.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧГруппировкиФинИнструменты.Ссылка КАК ДокументСсылка,
	|	ТЧГруппировкиФинИнструменты.ТипРасчетов КАК ТипРасчетов,
	|	ТЧДетальныеЗаписиФинИнструменты.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ТЧДетальныеЗаписиФинИнструменты.ОписаниеДокумента КАК ОписаниеДокумента,
	|	ТЧГруппировкиФинИнструменты.Валюта КАК Валюта,
	|	ТЧДетальныеЗаписиФинИнструменты.ВалютаДокумента КАК ВалютаДокумента,
	|	
	|	ТЧДетальныеЗаписиФинИнструменты.Договор КАК Договор,
	|	ТЧДетальныеЗаписиФинИнструменты.Договор.ХарактерДоговора КАК ХарактерДоговора,
	|	
	|	ТЧДетальныеЗаписиФинИнструменты.ОсновнойДолг КАК ОсновнойДолг,
	|	ВЫБОР 
	|		КОГДА ТЧДетальныеЗаписиФинИнструменты.Ссылка.ЕстьРасхождения
	|			ТОГДА 
	|				ТЧДетальныеЗаписиФинИнструменты.ОсновнойДолгКонтрагент
	|		ИНАЧЕ
	|			ТЧДетальныеЗаписиФинИнструменты.ОсновнойДолг
	|	КОНЕЦ КАК ОсновнойДолгКонтрагент,
	|	ТЧДетальныеЗаписиФинИнструменты.Проценты КАК Проценты,
	|	ВЫБОР
	|		КОГДА ТЧДетальныеЗаписиФинИнструменты.Ссылка.ЕстьРасхождения
	|		ТОГДА 
	|			ТЧДетальныеЗаписиФинИнструменты.ПроцентыКонтрагент
	|		ИНАЧЕ
	|			ТЧДетальныеЗаписиФинИнструменты.Проценты
	|	КОНЕЦ КАК ПроцентыКонтрагент,
	|	ТЧДетальныеЗаписиФинИнструменты.Комиссия КАК Комиссия,
	|	ВЫБОР
	|		КОГДА ТЧДетальныеЗаписиФинИнструменты.Ссылка.ЕстьРасхождения
	|		ТОГДА
	|			ТЧДетальныеЗаписиФинИнструменты.КомиссияКонтрагент
	|		ИНАЧЕ
	|			ТЧДетальныеЗаписиФинИнструменты.Комиссия
	|	КОНЕЦ КАК КомиссияКонтрагент,
	|	
	|	ТЧДетальныеЗаписиФинИнструменты.АрендныеОбязательства КАК АрендныеОбязательства,
	|	ВЫБОР
	|		КОГДА ТЧДетальныеЗаписиФинИнструменты.Ссылка.ЕстьРасхождения
	|		ТОГДА 
	|			ТЧДетальныеЗаписиФинИнструменты.АрендныеОбязательстваКонтрагент
	|		ИНАЧЕ
	|			ТЧДетальныеЗаписиФинИнструменты.АрендныеОбязательства
	|	КОНЕЦ КАК АрендныеОбязательстваКонтрагент,
	|	ТЧДетальныеЗаписиФинИнструменты.ОбеспечительныйПлатеж КАК ОбеспечительныйПлатеж,
	|	ВЫБОР
	|		КОГДА ТЧДетальныеЗаписиФинИнструменты.Ссылка.ЕстьРасхождения
	|		ТОГДА 
	|			ТЧДетальныеЗаписиФинИнструменты.ОбеспечительныйПлатежКонтрагент
	|		ИНАЧЕ
	|			ТЧДетальныеЗаписиФинИнструменты.ОбеспечительныйПлатеж
	|	КОНЕЦ КАК ОбеспечительныйПлатежКонтрагент,
	|	ТЧДетальныеЗаписиФинИнструменты.ЛизинговыйПлатеж КАК ЛизинговыйПлатеж,
	|	ВЫБОР
	|		КОГДА ТЧДетальныеЗаписиФинИнструменты.Ссылка.ЕстьРасхождения
	|		ТОГДА 
	|			ТЧДетальныеЗаписиФинИнструменты.ЛизинговыйПлатежКонтрагент
	|		ИНАЧЕ
	|			ТЧДетальныеЗаписиФинИнструменты.ЛизинговыйПлатеж
	|	КОНЕЦ КАК ЛизинговыйПлатежКонтрагент,
	|	ТЧДетальныеЗаписиФинИнструменты.ВыкупПредметаЛизинга КАК ВыкупПредметаЛизинга,
	|	ВЫБОР
	|		КОГДА ТЧДетальныеЗаписиФинИнструменты.Ссылка.ЕстьРасхождения
	|		ТОГДА 
	|			ТЧДетальныеЗаписиФинИнструменты.ВыкупПредметаЛизингаКонтрагент
	|		ИНАЧЕ
	|			ТЧДетальныеЗаписиФинИнструменты.ВыкупПредметаЛизинга
	|	КОНЕЦ КАК ВыкупПредметаЛизингаКонтрагент
	|	
	|ПОМЕСТИТЬ ДетальныеЗаписиФинансовыеИнструменты
	|ИЗ
	|	Документ.СверкаВзаиморасчетов.ГруппировкиФинансовыеИнструменты КАК ТЧГруппировкиФинИнструменты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СверкаВзаиморасчетов.ДетальныеЗаписиФинансовыеИнструменты КАК ТЧДетальныеЗаписиФинИнструменты
	|		ПО ТЧГруппировкиФинИнструменты.Ссылка = ТЧДетальныеЗаписиФинИнструменты.Ссылка
	|			И ТЧГруппировкиФинИнструменты.Договор = ТЧДетальныеЗаписиФинИнструменты.Договор
	|ГДЕ
	|	ТЧГруппировкиФинИнструменты.Ссылка В(&МассивОбъектов)
	|	И ТЧДетальныеЗаписиФинИнструменты.Ссылка В(&МассивОбъектов)
	|	И (&ВыводитьВВалютеРегл И ТЧДетальныеЗаписиФинИнструменты.ВалютаДокумента = &ВалютаРегл И ТЧГруппировкиФинИнструменты.Валюта = &ВалютаРегл
	|		ИЛИ НЕ &ВыводитьВВалютеРегл
	|	)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГруппировкаФинИнструментов.Ссылка КАК ДокументСсылка,
	|	ГруппировкаФинИнструментов.ТипРасчетов КАК ТипРасчетов,
	|	ГруппировкаФинИнструментов.Договор КАК ОбъектГруппировки,
	|	ГруппировкаФинИнструментов.Валюта КАК Валюта,
	|	СУММА(ГруппировкаФинИнструментов.НачальноеСальдоДт) КАК НачальноеСальдоДт,
	|	СУММА(ГруппировкаФинИнструментов.НачальноеСальдоКт) КАК НачальноеСальдоКт,
	|	СУММА(ГруппировкаФинИнструментов.ОборотПриход) КАК ОборотПриход,
	|	СУММА(ГруппировкаФинИнструментов.ОборотРасход) КАК ОборотРасход,
	|	СУММА(ГруппировкаФинИнструментов.КонечноеСальдоДт) КАК КонечноеСальдоДт,
	|	СУММА(ГруппировкаФинИнструментов.КонечноеСальдоКт) КАК КонечноеСальдоКт
	|ПОМЕСТИТЬ втГруппировкиФинИнструментов
	|ИЗ
	|	Документ.СверкаВзаиморасчетов.ГруппировкиФинансовыеИнструменты КАК ГруппировкаФинИнструментов
	|ГДЕ
	|	ГруппировкаФинИнструментов.Ссылка В(&МассивОбъектов)
	|	И (&ВыводитьВВалютеРегл И ГруппировкаФинИнструментов.Валюта = &ВалютаРегл
	|		ИЛИ НЕ &ВыводитьВВалютеРегл
	|	)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГруппировкаФинИнструментов.Ссылка,
	|	ГруппировкаФинИнструментов.ТипРасчетов,
	|	ГруппировкаФинИнструментов.Договор,
	|	ГруппировкаФинИнструментов.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Группировки.ДокументСсылка КАК ДокументСсылка,
	|	Группировки.ТипРасчетов КАК ТипРасчетов,
	|	Группировки.ОбъектГруппировки КАК ОбъектГруппировки,
	|	ПредставлениеСсылки(Группировки.ОбъектГруппировки) КАК ПредставлениеОбъектГруппировки,
	|	
	|	Группировки.НачальноеСальдоДт КАК НачальноеСальдоДт,
	|	Группировки.НачальноеСальдоКт КАК НачальноеСальдоКт,
	|	Группировки.ОборотПриход КАК ОборотПриход,
	|	Группировки.ОборотРасход КАК ОборотРасход,
	|	Группировки.КонечноеСальдоДт КАК КонечноеСальдоДт,
	|	Группировки.КонечноеСальдоКт КАК КонечноеСальдоКт,
	|	
	|	ЕСТЬNULL(ДеталиФинИнструментов.Договор, НЕОПРЕДЕЛЕНО) КАК Договор,
	|	ДеталиФинИнструментов.ХарактерДоговора КАК ХарактерДоговора,
	|	ДеталиФинИнструментов.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДеталиФинИнструментов.ОписаниеДокумента КАК ОписаниеДокумента,
	|	Группировки.Валюта КАК Валюта,
	|	ДеталиФинИнструментов.ВалютаДокумента КАК ВалютаДокумента,
	|	
	|	ЕСТЬNULL(ДеталиФинИнструментов.ОсновнойДолг, 0) КАК ОсновнойДолг,
	|	ЕСТЬNULL(ДеталиФинИнструментов.ОсновнойДолгКонтрагент, 0) КАК ОсновнойДолгКонтрагент,
	|	ЕСТЬNULL(ДеталиФинИнструментов.Проценты, 0) КАК Проценты,
	|	ЕСТЬNULL(ДеталиФинИнструментов.ПроцентыКонтрагент, 0) КАК ПроцентыКонтрагент,
	|	ЕСТЬNULL(ДеталиФинИнструментов.Комиссия, 0) КАК Комиссия,
	|	ЕСТЬNULL(ДеталиФинИнструментов.КомиссияКонтрагент, 0) КАК КомиссияКонтрагент,
	|	
	|	ЕСТЬNULL(ДеталиФинИнструментов.АрендныеОбязательства, 0) КАК АрендныеОбязательства,
	|	ЕСТЬNULL(ДеталиФинИнструментов.АрендныеОбязательстваКонтрагент, 0) КАК АрендныеОбязательстваКонтрагент,
	|	ЕСТЬNULL(ДеталиФинИнструментов.ОбеспечительныйПлатеж, 0) КАК ОбеспечительныйПлатеж,
	|	ЕСТЬNULL(ДеталиФинИнструментов.ОбеспечительныйПлатежКонтрагент, 0) КАК ОбеспечительныйПлатежКонтрагент,
	|	ЕСТЬNULL(ДеталиФинИнструментов.ЛизинговыйПлатеж, 0) КАК ЛизинговыйПлатеж,
	|	ЕСТЬNULL(ДеталиФинИнструментов.ЛизинговыйПлатежКонтрагент, 0) КАК ЛизинговыйПлатежКонтрагент,
	|	ЕСТЬNULL(ДеталиФинИнструментов.ВыкупПредметаЛизинга, 0) КАК ВыкупПредметаЛизинга,
	|	ЕСТЬNULL(ДеталиФинИнструментов.ВыкупПредметаЛизингаКонтрагент, 0) КАК ВыкупПредметаЛизингаКонтрагент
	|	
	|ПОМЕСТИТЬ ДеталиФинИнструментовБезТипаСумм
	|ИЗ
	|	втГруппировкиФинИнструментов КАК Группировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДетальныеЗаписиФинансовыеИнструменты КАК ДеталиФинИнструментов
	|		ПО Группировки.ДокументСсылка = ДеталиФинИнструментов.ДокументСсылка
	|			И Группировки.ТипРасчетов = ДеталиФинИнструментов.ТипРасчетов
	|			И Группировки.ОбъектГруппировки = ДеталиФинИнструментов.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДеталиФинИнструментов.ДокументСсылка КАК ДокументСсылка,
	|	ДеталиФинИнструментов.ТипРасчетов КАК ТипРасчетов,
	|	ДеталиФинИнструментов.ОбъектГруппировки КАК ОбъектГруппировки,
	|	ДеталиФинИнструментов.ПредставлениеОбъектГруппировки КАК ПредставлениеОбъектГруппировки,
	|	
	|	ДеталиФинИнструментов.НачальноеСальдоДт КАК НачальноеСальдоДт,
	|	ДеталиФинИнструментов.НачальноеСальдоКт КАК НачальноеСальдоКт,
	|	ДеталиФинИнструментов.ОборотПриход КАК ОборотПриход,
	|	ДеталиФинИнструментов.ОборотРасход КАК ОборотРасход,
	|	ДеталиФинИнструментов.КонечноеСальдоДт КАК КонечноеСальдоДт,
	|	ДеталиФинИнструментов.КонечноеСальдоКт КАК КонечноеСальдоКт,
	|	
	|	ЛОЖЬ КАК ЕстьОбороты,
	|	ДеталиФинИнструментов.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДеталиФинИнструментов.ОписаниеДокумента КАК ОписаниеДокумента,
	|	ДеталиФинИнструментов.ХарактерДоговора КАК ХарактерДоговора,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ПустаяСсылка) КАК ТипСуммы,
	|	ДеталиФинИнструментов.Валюта КАК Валюта,
	|	ДеталиФинИнструментов.ВалютаДокумента КАК ВалютаДокумента,
	|	
	|	0 КАК СуммаДебет,
	|	0 КАК СуммаКредит,
	|
	|	0 КАК СуммаДебетКонтрагент,
	|	0 КАК СуммаКредитКонтрагент,
	|	
	|	ДеталиФинИнструментов.ОсновнойДолг КАК ОсновнойДолг,
	|	ДеталиФинИнструментов.ОсновнойДолгКонтрагент КАК ОсновнойДолгКонтрагент,
	|	ДеталиФинИнструментов.Проценты КАК Проценты,
	|	ДеталиФинИнструментов.ПроцентыКонтрагент КАК ПроцентыКонтрагент,
	|	ДеталиФинИнструментов.Комиссия КАК Комиссия,
	|	ДеталиФинИнструментов.КомиссияКонтрагент КАК КомиссияКонтрагент,
	|	
	|	ДеталиФинИнструментов.АрендныеОбязательства КАК АрендныеОбязательства,
	|	ДеталиФинИнструментов.АрендныеОбязательстваКонтрагент КАК АрендныеОбязательстваКонтрагент,
	|	ДеталиФинИнструментов.ОбеспечительныйПлатеж КАК ОбеспечительныйПлатеж,
	|	ДеталиФинИнструментов.ОбеспечительныйПлатежКонтрагент КАК ОбеспечительныйПлатежКонтрагент,
	|	ДеталиФинИнструментов.ЛизинговыйПлатеж КАК ЛизинговыйПлатеж,
	|	ДеталиФинИнструментов.ЛизинговыйПлатежКонтрагент КАК ЛизинговыйПлатежКонтрагент,
	|	ДеталиФинИнструментов.ВыкупПредметаЛизинга КАК ВыкупПредметаЛизинга,
	|	ДеталиФинИнструментов.ВыкупПредметаЛизингаКонтрагент КАК ВыкупПредметаЛизингаКонтрагент
	|	
	|ПОМЕСТИТЬ ДеталиФинИнструментов
	|ИЗ
	|	ДеталиФинИнструментовБезТипаСумм КАК ДеталиФинИнструментов
	|ГДЕ
	|	ДеталиФинИнструментов.Договор = НЕОПРЕДЕЛЕНО //нет детальных записей по договору
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДеталиФинИнструментов.ДокументСсылка КАК ДокументСсылка,
	|	ДеталиФинИнструментов.ТипРасчетов КАК ТипРасчетов,
	|	ДеталиФинИнструментов.ОбъектГруппировки КАК ОбъектГруппировки,
	|	ДеталиФинИнструментов.ПредставлениеОбъектГруппировки КАК ПредставлениеОбъектГруппировки,
	|	
	|	ДеталиФинИнструментов.НачальноеСальдоДт КАК НачальноеСальдоДт,
	|	ДеталиФинИнструментов.НачальноеСальдоКт КАК НачальноеСальдоКт,
	|	ДеталиФинИнструментов.ОборотПриход КАК ОборотПриход,
	|	ДеталиФинИнструментов.ОборотРасход КАК ОборотРасход,
	|	ДеталиФинИнструментов.КонечноеСальдоДт КАК КонечноеСальдоДт,
	|	ДеталиФинИнструментов.КонечноеСальдоКт КАК КонечноеСальдоКт,
	|	
	|	ИСТИНА КАК ЕстьОбороты,
	|	ДеталиФинИнструментов.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДеталиФинИнструментов.ОписаниеДокумента КАК ОписаниеДокумента,
	|	ДеталиФинИнструментов.ХарактерДоговора КАК ХарактерДоговора,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг) КАК ТипСуммы,
	|	ДеталиФинИнструментов.Валюта КАК Валюта,
	|	ДеталиФинИнструментов.ВалютаДокумента КАК ВалютаДокумента,
	|	
	|	ВЫБОР
	|		КОГДА ДеталиФинИнструментов.ОсновнойДолг > 0
	|			ТОГДА
	|				ДеталиФинИнструментов.ОсновнойДолг
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаДебет,
	|	ВЫБОР
	|		КОГДА ДеталиФинИнструментов.ОсновнойДолг < 0
	|			ТОГДА
	|				-ДеталиФинИнструментов.ОсновнойДолг
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаКредит,
	|
	|	ВЫБОР
	|		КОГДА ДеталиФинИнструментов.ОсновнойДолгКонтрагент < 0
	|			ТОГДА 
	|				-ДеталиФинИнструментов.ОсновнойДолгКонтрагент
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаДебетКонтрагент,
	|	ВЫБОР
	|		КОГДА ДеталиФинИнструментов.ОсновнойДолгКонтрагент > 0
	|			ТОГДА 
	|				ДеталиФинИнструментов.ОсновнойДолгКонтрагент
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаКредитКонтрагент,
	|	
	|	ДеталиФинИнструментов.ОсновнойДолг КАК ОсновнойДолг,
	|	ДеталиФинИнструментов.ОсновнойДолгКонтрагент КАК ОсновнойДолгКонтрагент,
	|	0 КАК Проценты,
	|	0 КАК ПроцентыКонтрагент,
	|	0 КАК Комиссия,
	|	0 КАК КомиссияКонтрагент,
	|	
	|	0 КАК АрендныеОбязательства,
	|	0 КАК АрендныеОбязательстваКонтрагент,
	|	0 КАК ОбеспечительныйПлатеж,
	|	0 КАК ОбеспечительныйПлатежКонтрагент,
	|	0 КАК ЛизинговыйПлатеж,
	|	0 КАК ЛизинговыйПлатежКонтрагент,
	|	0 КАК ВыкупПредметаЛизинга,
	|	0 КАК ВыкупПредметаЛизингаКонтрагент
	|ИЗ
	|	ДеталиФинИнструментовБезТипаСумм КАК ДеталиФинИнструментов
	|ГДЕ
	|	ДеталиФинИнструментов.ОсновнойДолг <> 0
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДеталиФинИнструментов.ДокументСсылка КАК ДокументСсылка,
	|	ДеталиФинИнструментов.ТипРасчетов КАК ТипРасчетов,
	|	ДеталиФинИнструментов.ОбъектГруппировки КАК ОбъектГруппировки,
	|	ДеталиФинИнструментов.ПредставлениеОбъектГруппировки КАК ПредставлениеОбъектГруппировки,
	|	
	|	ДеталиФинИнструментов.НачальноеСальдоДт КАК НачальноеСальдоДт,
	|	ДеталиФинИнструментов.НачальноеСальдоКт КАК НачальноеСальдоКт,
	|	ДеталиФинИнструментов.ОборотПриход КАК ОборотПриход,
	|	ДеталиФинИнструментов.ОборотРасход КАК ОборотРасход,
	|	ДеталиФинИнструментов.КонечноеСальдоДт КАК КонечноеСальдоДт,
	|	ДеталиФинИнструментов.КонечноеСальдоКт КАК КонечноеСальдоКт,
	|	
	|	ИСТИНА КАК ЕстьОбороты,
	|	ДеталиФинИнструментов.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДеталиФинИнструментов.ОписаниеДокумента КАК ОписаниеДокумента,
	|	ДеталиФинИнструментов.ХарактерДоговора КАК ХарактерДоговора,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты) КАК ТипСуммы,
	|	ДеталиФинИнструментов.Валюта КАК Валюта,
	|	ДеталиФинИнструментов.ВалютаДокумента КАК ВалютаДокумента,
	|	
	|	ВЫБОР
	|		КОГДА ДеталиФинИнструментов.Проценты > 0
	|			ТОГДА 
	|				ДеталиФинИнструментов.Проценты
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаДебет,
	|	ВЫБОР
	|		КОГДА ДеталиФинИнструментов.Проценты < 0
	|			ТОГДА 
	|				-ДеталиФинИнструментов.Проценты
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаКредит,
	|
	|	ВЫБОР
	|		КОГДА ДеталиФинИнструментов.ПроцентыКонтрагент < 0
	|			ТОГДА 
	|				-ДеталиФинИнструментов.ПроцентыКонтрагент
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаДебетКонтрагент,
	|	ВЫБОР
	|		КОГДА ДеталиФинИнструментов.ПроцентыКонтрагент > 0
	|			ТОГДА 
	|				ДеталиФинИнструментов.ПроцентыКонтрагент
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаКредитКонтрагент,
	|	
	|	0 КАК ОсновнойДолг,
	|	0 КАК ОсновнойДолгКонтрагент,
	|	ДеталиФинИнструментов.Проценты КАК Проценты,
	|	ДеталиФинИнструментов.ПроцентыКонтрагент КАК ПроцентыКонтрагент,
	|	0 КАК Комиссия,
	|	0 КАК КомиссияКонтрагент,
	|	
	|	0 КАК АрендныеОбязательства,
	|	0 КАК АрендныеОбязательстваКонтрагент,
	|	0 КАК ОбеспечительныйПлатеж,
	|	0 КАК ОбеспечительныйПлатежКонтрагент,
	|	0 КАК ЛизинговыйПлатеж,
	|	0 КАК ЛизинговыйПлатежКонтрагент,
	|	0 КАК ВыкупПредметаЛизинга,
	|	0 КАК ВыкупПредметаЛизингаКонтрагент
	|ИЗ
	|	ДеталиФинИнструментовБезТипаСумм КАК ДеталиФинИнструментов
	|ГДЕ
	|	ДеталиФинИнструментов.Проценты <> 0
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДеталиФинИнструментов.ДокументСсылка КАК ДокументСсылка,
	|	ДеталиФинИнструментов.ТипРасчетов КАК ТипРасчетов,
	|	ДеталиФинИнструментов.ОбъектГруппировки КАК ОбъектГруппировки,
	|	ДеталиФинИнструментов.ПредставлениеОбъектГруппировки КАК ПредставлениеОбъектГруппировки,
	|	
	|	ДеталиФинИнструментов.НачальноеСальдоДт КАК НачальноеСальдоДт,
	|	ДеталиФинИнструментов.НачальноеСальдоКт КАК НачальноеСальдоКт,
	|	ДеталиФинИнструментов.ОборотПриход КАК ОборотПриход,
	|	ДеталиФинИнструментов.ОборотРасход КАК ОборотРасход,
	|	ДеталиФинИнструментов.КонечноеСальдоДт КАК КонечноеСальдоДт,
	|	ДеталиФинИнструментов.КонечноеСальдоКт КАК КонечноеСальдоКт,
	|	
	|	ИСТИНА КАК ЕстьОбороты,
	|	ДеталиФинИнструментов.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДеталиФинИнструментов.ОписаниеДокумента КАК ОписаниеДокумента,
	|	ДеталиФинИнструментов.ХарактерДоговора КАК ХарактерДоговора,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Комиссия) КАК ТипСуммы,
	|	ДеталиФинИнструментов.Валюта КАК Валюта,
	|	ДеталиФинИнструментов.ВалютаДокумента КАК ВалютаДокумента,
	|	
	|	ВЫБОР
	|		КОГДА ДеталиФинИнструментов.Комиссия > 0
	|			ТОГДА 
	|				ДеталиФинИнструментов.Комиссия
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаДебет,
	|	ВЫБОР
	|		КОГДА ДеталиФинИнструментов.Комиссия < 0
	|			ТОГДА 
	|				-ДеталиФинИнструментов.Комиссия
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаКредит,
	|
	|	ВЫБОР
	|		КОГДА ДеталиФинИнструментов.КомиссияКонтрагент < 0
	|			ТОГДА 
	|				-ДеталиФинИнструментов.КомиссияКонтрагент
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаДебетКонтрагент,
	|	ВЫБОР
	|		КОГДА ДеталиФинИнструментов.КомиссияКонтрагент > 0
	|			ТОГДА 
	|				ДеталиФинИнструментов.КомиссияКонтрагент
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаКредитКонтрагент,
	|	
	|	0 КАК ОсновнойДолг,
	|	0 КАК ОсновнойДолгКонтрагент,
	|	0 КАК Проценты,
	|	0 КАК ПроцентыКонтрагент,
	|	ДеталиФинИнструментов.Комиссия КАК Комиссия,
	|	ДеталиФинИнструментов.КомиссияКонтрагент КАК КомиссияКонтрагент,
	|	
	|	0 КАК АрендныеОбязательства,
	|	0 КАК АрендныеОбязательстваКонтрагент,
	|	0 КАК ОбеспечительныйПлатеж,
	|	0 КАК ОбеспечительныйПлатежКонтрагент,
	|	0 КАК ЛизинговыйПлатеж,
	|	0 КАК ЛизинговыйПлатежКонтрагент,
	|	0 КАК ВыкупПредметаЛизинга,
	|	0 КАК ВыкупПредметаЛизингаКонтрагент
	|ИЗ
	|	ДеталиФинИнструментовБезТипаСумм КАК ДеталиФинИнструментов
	|ГДЕ
	|	ДеталиФинИнструментов.Комиссия <> 0
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДеталиФинИнструментов.ДокументСсылка КАК ДокументСсылка,
	|	ДеталиФинИнструментов.ТипРасчетов КАК ТипРасчетов,
	|	ДеталиФинИнструментов.ОбъектГруппировки КАК ОбъектГруппировки,
	|	ДеталиФинИнструментов.ПредставлениеОбъектГруппировки КАК ПредставлениеОбъектГруппировки,
	|	
	|	ДеталиФинИнструментов.НачальноеСальдоДт КАК НачальноеСальдоДт,
	|	ДеталиФинИнструментов.НачальноеСальдоКт КАК НачальноеСальдоКт,
	|	ДеталиФинИнструментов.ОборотПриход КАК ОборотПриход,
	|	ДеталиФинИнструментов.ОборотРасход КАК ОборотРасход,
	|	ДеталиФинИнструментов.КонечноеСальдоДт КАК КонечноеСальдоДт,
	|	ДеталиФинИнструментов.КонечноеСальдоКт КАК КонечноеСальдоКт,
	|	
	|	ИСТИНА КАК ЕстьОбороты,
	|	ДеталиФинИнструментов.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДеталиФинИнструментов.ОписаниеДокумента КАК ОписаниеДокумента,
	|	ДеталиФинИнструментов.ХарактерДоговора КАК ХарактерДоговора,
	|	&АрендныеОбязательства КАК ТипСуммы,
	|	ДеталиФинИнструментов.Валюта КАК Валюта,
	|	ДеталиФинИнструментов.ВалютаДокумента КАК ВалютаДокумента,
	|	
	|	0 КАК СуммаДебет,
	|	0 КАК СуммаКредит,
	|
	|	0 КАК СуммаДебетКонтрагент,
	|	0 КАК СуммаКредитКонтрагент,
	|	
	|	0 КАК ОсновнойДолг,
	|	0 КАК ОсновнойДолгКонтрагент,
	|	0 КАК Проценты,
	|	0 КАК ПроцентыКонтрагент,
	|	0 КАК Комиссия,
	|	0 КАК КомиссияКонтрагент,
	|	
	|	0 КАК АрендныеОбязательства,
	|	0 КАК АрендныеОбязательстваКонтрагент,
	|	0 КАК ОбеспечительныйПлатеж,
	|	0 КАК ОбеспечительныйПлатежКонтрагент,
	|	0 КАК ЛизинговыйПлатеж,
	|	0 КАК ЛизинговыйПлатежКонтрагент,
	|	0 КАК ВыкупПредметаЛизинга,
	|	0 КАК ВыкупПредметаЛизингаКонтрагент
	|ИЗ
	|	ДеталиФинИнструментовБезТипаСумм КАК ДеталиФинИнструментов
	|ГДЕ
	|	ДеталиФинИнструментов.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.Лизинг)
	|	И ДеталиФинИнструментов.АрендныеОбязательства = 0
	|	И ДеталиФинИнструментов.ОбеспечительныйПлатеж = 0
	|	И ДеталиФинИнструментов.ЛизинговыйПлатеж = 0
	|	И ДеталиФинИнструментов.ВыкупПредметаЛизинга = 0
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДеталиФинИнструментов.ДокументСсылка КАК ДокументСсылка,
	|	ДеталиФинИнструментов.ТипРасчетов КАК ТипРасчетов,
	|	ДеталиФинИнструментов.ОбъектГруппировки КАК ОбъектГруппировки,
	|	ДеталиФинИнструментов.ПредставлениеОбъектГруппировки КАК ПредставлениеОбъектГруппировки,
	|	
	|	ДеталиФинИнструментов.НачальноеСальдоДт КАК НачальноеСальдоДт,
	|	ДеталиФинИнструментов.НачальноеСальдоКт КАК НачальноеСальдоКт,
	|	ДеталиФинИнструментов.ОборотПриход КАК ОборотПриход,
	|	ДеталиФинИнструментов.ОборотРасход КАК ОборотРасход,
	|	ДеталиФинИнструментов.КонечноеСальдоДт КАК КонечноеСальдоДт,
	|	ДеталиФинИнструментов.КонечноеСальдоКт КАК КонечноеСальдоКт,
	|	
	|	ИСТИНА КАК ЕстьОбороты,
	|	ДеталиФинИнструментов.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДеталиФинИнструментов.ОписаниеДокумента КАК ОписаниеДокумента,
	|	ДеталиФинИнструментов.ХарактерДоговора КАК ХарактерДоговора,
	|	&АрендныеОбязательства КАК ТипСуммы,
	|	ДеталиФинИнструментов.Валюта КАК Валюта,
	|	ДеталиФинИнструментов.ВалютаДокумента КАК ВалютаДокумента,
	|	
	|	ВЫБОР 
	|		КОГДА ДеталиФинИнструментов.АрендныеОбязательства > 0
	|			ТОГДА
	|				ДеталиФинИнструментов.АрендныеОбязательства
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаДебет,
	|	ВЫБОР 
	|		КОГДА ДеталиФинИнструментов.АрендныеОбязательства < 0
	|			ТОГДА
	|				-ДеталиФинИнструментов.АрендныеОбязательства
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаКредит,
	|
	|	ВЫБОР 
	|		КОГДА ДеталиФинИнструментов.АрендныеОбязательстваКонтрагент < 0
	|			ТОГДА
	|				-ДеталиФинИнструментов.АрендныеОбязательстваКонтрагент
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаДебетКонтрагент,
	|	ВЫБОР 
	|		КОГДА ДеталиФинИнструментов.АрендныеОбязательстваКонтрагент > 0
	|			ТОГДА
	|				ДеталиФинИнструментов.АрендныеОбязательстваКонтрагент
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаКредитКонтрагент,
	|	
	|	0 КАК ОсновнойДолг,
	|	0 КАК ОсновнойДолгКонтрагент,
	|	0 КАК Проценты,
	|	0 КАК ПроцентыКонтрагент,
	|	0 КАК Комиссия,
	|	0 КАК КомиссияКонтрагент,
	|	
	|	ДеталиФинИнструментов.АрендныеОбязательства КАК АрендныеОбязательства,
	|	ДеталиФинИнструментов.АрендныеОбязательстваКонтрагент КАК АрендныеОбязательстваКонтрагент,
	|	0 КАК ОбеспечительныйПлатеж,
	|	0 КАК ОбеспечительныйПлатежКонтрагент,
	|	0 КАК ЛизинговыйПлатеж,
	|	0 КАК ЛизинговыйПлатежКонтрагент,
	|	0 КАК ВыкупПредметаЛизинга,
	|	0 КАК ВыкупПредметаЛизингаКонтрагент
	|ИЗ
	|	ДеталиФинИнструментовБезТипаСумм КАК ДеталиФинИнструментов
	|ГДЕ
	|	ДеталиФинИнструментов.АрендныеОбязательства <> 0
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДеталиФинИнструментов.ДокументСсылка КАК ДокументСсылка,
	|	ДеталиФинИнструментов.ТипРасчетов КАК ТипРасчетов,
	|	ДеталиФинИнструментов.ОбъектГруппировки КАК ОбъектГруппировки,
	|	ДеталиФинИнструментов.ПредставлениеОбъектГруппировки КАК ПредставлениеОбъектГруппировки,
	|	
	|	ДеталиФинИнструментов.НачальноеСальдоДт КАК НачальноеСальдоДт,
	|	ДеталиФинИнструментов.НачальноеСальдоКт КАК НачальноеСальдоКт,
	|	ДеталиФинИнструментов.ОборотПриход КАК ОборотПриход,
	|	ДеталиФинИнструментов.ОборотРасход КАК ОборотРасход,
	|	ДеталиФинИнструментов.КонечноеСальдоДт КАК КонечноеСальдоДт,
	|	ДеталиФинИнструментов.КонечноеСальдоКт КАК КонечноеСальдоКт,
	|	
	|	ИСТИНА КАК ЕстьОбороты,
	|	ДеталиФинИнструментов.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДеталиФинИнструментов.ОписаниеДокумента КАК ОписаниеДокумента,
	|	ДеталиФинИнструментов.ХарактерДоговора КАК ХарактерДоговора,
	|	&ОбеспечительныйПлатеж КАК ТипСуммы,
	|	ДеталиФинИнструментов.Валюта КАК Валюта,
	|	ДеталиФинИнструментов.ВалютаДокумента КАК ВалютаДокумента,
	|	
	|	ВЫБОР 
	|		КОГДА ДеталиФинИнструментов.ОбеспечительныйПлатеж > 0
	|			ТОГДА
	|				ДеталиФинИнструментов.ОбеспечительныйПлатеж
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаДебет,
	|	ВЫБОР 
	|		КОГДА ДеталиФинИнструментов.ОбеспечительныйПлатеж < 0
	|			ТОГДА
	|				-ДеталиФинИнструментов.ОбеспечительныйПлатеж
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаКредит,
	|
	|	ВЫБОР 
	|		КОГДА ДеталиФинИнструментов.ОбеспечительныйПлатежКонтрагент < 0
	|			ТОГДА
	|				-ДеталиФинИнструментов.ОбеспечительныйПлатежКонтрагент
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаДебетКонтрагент,
	|	ВЫБОР 
	|		КОГДА ДеталиФинИнструментов.ОбеспечительныйПлатежКонтрагент > 0
	|			ТОГДА
	|				ДеталиФинИнструментов.ОбеспечительныйПлатежКонтрагент
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаКредитКонтрагент,
	|	
	|	0 КАК ОсновнойДолг,
	|	0 КАК ОсновнойДолгКонтрагент,
	|	0 КАК Проценты,
	|	0 КАК ПроцентыКонтрагент,
	|	0 КАК Комиссия,
	|	0 КАК КомиссияКонтрагент,
	|	
	|	0 КАК АрендныеОбязательства,
	|	0 КАК АрендныеОбязательстваКонтрагент,
	|	ДеталиФинИнструментов.ОбеспечительныйПлатеж КАК ОбеспечительныйПлатеж,
	|	ДеталиФинИнструментов.ОбеспечительныйПлатежКонтрагент КАК ОбеспечительныйПлатежКонтрагент,
	|	0 КАК ЛизинговыйПлатеж,
	|	0 КАК ЛизинговыйПлатежКонтрагент,
	|	0 КАК ВыкупПредметаЛизинга,
	|	0 КАК ВыкупПредметаЛизингаКонтрагент
	|ИЗ
	|	ДеталиФинИнструментовБезТипаСумм КАК ДеталиФинИнструментов
	|ГДЕ
	|	ДеталиФинИнструментов.ОбеспечительныйПлатеж <> 0
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДеталиФинИнструментов.ДокументСсылка КАК ДокументСсылка,
	|	ДеталиФинИнструментов.ТипРасчетов КАК ТипРасчетов,
	|	ДеталиФинИнструментов.ОбъектГруппировки КАК ОбъектГруппировки,
	|	ДеталиФинИнструментов.ПредставлениеОбъектГруппировки КАК ПредставлениеОбъектГруппировки,
	|	
	|	ДеталиФинИнструментов.НачальноеСальдоДт КАК НачальноеСальдоДт,
	|	ДеталиФинИнструментов.НачальноеСальдоКт КАК НачальноеСальдоКт,
	|	ДеталиФинИнструментов.ОборотПриход КАК ОборотПриход,
	|	ДеталиФинИнструментов.ОборотРасход КАК ОборотРасход,
	|	ДеталиФинИнструментов.КонечноеСальдоДт КАК КонечноеСальдоДт,
	|	ДеталиФинИнструментов.КонечноеСальдоКт КАК КонечноеСальдоКт,
	|	
	|	ИСТИНА КАК ЕстьОбороты,
	|	ДеталиФинИнструментов.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДеталиФинИнструментов.ОписаниеДокумента КАК ОписаниеДокумента,
	|	ДеталиФинИнструментов.ХарактерДоговора КАК ХарактерДоговора,
	|	&ЛизинговыйПлатеж КАК ТипСуммы,
	|	ДеталиФинИнструментов.Валюта КАК Валюта,
	|	ДеталиФинИнструментов.ВалютаДокумента КАК ВалютаДокумента,
	|	
	|	ВЫБОР 
	|		КОГДА ДеталиФинИнструментов.ЛизинговыйПлатеж > 0
	|			ТОГДА
	|				ДеталиФинИнструментов.ЛизинговыйПлатеж
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаДебет,
	|	ВЫБОР 
	|		КОГДА ДеталиФинИнструментов.ЛизинговыйПлатеж < 0
	|			ТОГДА
	|				-ДеталиФинИнструментов.ЛизинговыйПлатеж
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаКредит,
	|
	|	ВЫБОР 
	|		КОГДА ДеталиФинИнструментов.ЛизинговыйПлатежКонтрагент < 0
	|			ТОГДА
	|				-ДеталиФинИнструментов.ЛизинговыйПлатежКонтрагент
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаДебетКонтрагент,
	|	ВЫБОР 
	|		КОГДА ДеталиФинИнструментов.ЛизинговыйПлатежКонтрагент > 0
	|			ТОГДА
	|				ДеталиФинИнструментов.ЛизинговыйПлатежКонтрагент
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаКредитКонтрагент,
	|	
	|	0 КАК ОсновнойДолг,
	|	0 КАК ОсновнойДолгКонтрагент,
	|	0 КАК Проценты,
	|	0 КАК ПроцентыКонтрагент,
	|	0 КАК Комиссия,
	|	0 КАК КомиссияКонтрагент,
	|	
	|	0 КАК АрендныеОбязательства,
	|	0 КАК АрендныеОбязательстваКонтрагент,
	|	0 КАК ОбеспечительныйПлатеж,
	|	0 КАК ОбеспечительныйПлатежКонтрагент,
	|	ДеталиФинИнструментов.ЛизинговыйПлатеж КАК ЛизинговыйПлатеж,
	|	ДеталиФинИнструментов.ЛизинговыйПлатежКонтрагент КАК ЛизинговыйПлатежКонтрагент,
	|	0 КАК ВыкупПредметаЛизинга,
	|	0 КАК ВыкупПредметаЛизингаКонтрагент
	|ИЗ
	|	ДеталиФинИнструментовБезТипаСумм КАК ДеталиФинИнструментов
	|ГДЕ
	|	ДеталиФинИнструментов.ЛизинговыйПлатеж <> 0
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДеталиФинИнструментов.ДокументСсылка КАК ДокументСсылка,
	|	ДеталиФинИнструментов.ТипРасчетов КАК ТипРасчетов,
	|	ДеталиФинИнструментов.ОбъектГруппировки КАК ОбъектГруппировки,
	|	ДеталиФинИнструментов.ПредставлениеОбъектГруппировки КАК ПредставлениеОбъектГруппировки,
	|	
	|	ДеталиФинИнструментов.НачальноеСальдоДт КАК НачальноеСальдоДт,
	|	ДеталиФинИнструментов.НачальноеСальдоКт КАК НачальноеСальдоКт,
	|	ДеталиФинИнструментов.ОборотПриход КАК ОборотПриход,
	|	ДеталиФинИнструментов.ОборотРасход КАК ОборотРасход,
	|	ДеталиФинИнструментов.КонечноеСальдоДт КАК КонечноеСальдоДт,
	|	ДеталиФинИнструментов.КонечноеСальдоКт КАК КонечноеСальдоКт,
	|	
	|	ИСТИНА КАК ЕстьОбороты,
	|	ДеталиФинИнструментов.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДеталиФинИнструментов.ОписаниеДокумента КАК ОписаниеДокумента,
	|	ДеталиФинИнструментов.ХарактерДоговора КАК ХарактерДоговора,
	|	&ВыкупПредметаЛизинга КАК ТипСуммы,
	|	ДеталиФинИнструментов.Валюта КАК Валюта,
	|	ДеталиФинИнструментов.ВалютаДокумента КАК ВалютаДокумента,
	|	
	|	ВЫБОР 
	|		КОГДА ДеталиФинИнструментов.ВыкупПредметаЛизинга > 0
	|			ТОГДА
	|				ДеталиФинИнструментов.ВыкупПредметаЛизинга
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаДебет,
	|	ВЫБОР 
	|		КОГДА ДеталиФинИнструментов.ВыкупПредметаЛизинга < 0
	|			ТОГДА
	|				-ДеталиФинИнструментов.ВыкупПредметаЛизинга
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаКредит,
	|
	|	ВЫБОР 
	|		КОГДА ДеталиФинИнструментов.ВыкупПредметаЛизингаКонтрагент < 0
	|			ТОГДА
	|				-ДеталиФинИнструментов.ВыкупПредметаЛизингаКонтрагент
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаДебетКонтрагент,
	|	ВЫБОР 
	|		КОГДА ДеталиФинИнструментов.ВыкупПредметаЛизингаКонтрагент > 0
	|			ТОГДА
	|				ДеталиФинИнструментов.ВыкупПредметаЛизингаКонтрагент
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаКредитКонтрагент,
	|	
	|	0 КАК ОсновнойДолг,
	|	0 КАК ОсновнойДолгКонтрагент,
	|	0 КАК Проценты,
	|	0 КАК ПроцентыКонтрагент,
	|	0 КАК Комиссия,
	|	0 КАК КомиссияКонтрагент,
	|	
	|	0 КАК АрендныеОбязательства,
	|	0 КАК АрендныеОбязательстваКонтрагент,
	|	0 КАК ОбеспечительныйПлатеж,
	|	0 КАК ОбеспечительныйПлатежКонтрагент,
	|	0 КАК ЛизинговыйПлатеж,
	|	0 КАК ЛизинговыйПлатежКонтрагент,
	|	ДеталиФинИнструментов.ВыкупПредметаЛизинга КАК ВыкупПредметаЛизинга,
	|	ДеталиФинИнструментов.ВыкупПредметаЛизингаКонтрагент КАК ВыкупПредметаЛизингаКонтрагент
	|ИЗ
	|	ДеталиФинИнструментовБезТипаСумм КАК ДеталиФинИнструментов
	|ГДЕ
	|	ДеталиФинИнструментов.ВыкупПредметаЛизинга <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДеталиРасчетов.ДокументСсылка КАК ДокументСсылка,
	|	ДеталиРасчетов.ТипРасчетов КАК ТипРасчетов,
	|	ЛОЖЬ КАК ФинансовыеИнструменты,
	|	ДеталиРасчетов.ОбъектГруппировки КАК ОбъектГруппировки,
	|	ДеталиРасчетов.ПредставлениеОбъектГруппировки КАК ПредставлениеОбъектГруппировки,
	|	
	|	ДеталиРасчетов.ЕстьОбороты КАК ЕстьОбороты,
	|	ДеталиРасчетов.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДеталиРасчетов.ОписаниеДокумента КАК ОписаниеДокумента,
	|	ДеталиРасчетов.Валюта КАК Валюта,
	|	ДеталиРасчетов.ВалютаДокумента КАК ВалютаДокумента,
	|	
	|	ДеталиРасчетов.НачальноеСальдо КАК НачальноеСальдо,
	|	ДеталиРасчетов.НачальноеСальдоДт КАК НачальноеСальдоДт,
	|	ДеталиРасчетов.НачальноеСальдоКт КАК НачальноеСальдоКт,
	|	ДеталиРасчетов.ОборотПриход КАК ОборотПриход,
	|	ДеталиРасчетов.ОборотРасход КАК ОборотРасход,
	|	ДеталиРасчетов.КонечноеСальдо КАК КонечноеСальдо,
	|	ДеталиРасчетов.КонечноеСальдоДт КАК КонечноеСальдоДт,
	|	ДеталиРасчетов.КонечноеСальдоКт КАК КонечноеСальдоКт,
	|	
	|	СУММА(ДеталиРасчетов.СуммаДебет) КАК СуммаДебет,
	|	СУММА(ДеталиРасчетов.СуммаКредит) КАК СуммаКредит,
	|
	|	СУММА(ДеталиРасчетов.СуммаДебетКонтрагент) КАК СуммаДебетКонтрагент,
	|	СУММА(ДеталиРасчетов.СуммаКредитКонтрагент) КАК СуммаКредитКонтрагент,
	|	
	|	ДеталиРасчетов.СуммаДокумента КАК СуммаДокумента,
	|	ДеталиРасчетов.СуммаДокументаКонтрагент КАК СуммаДокументаКонтрагент,
	|	СУММА(ДеталиРасчетов.СуммаДолг) КАК СуммаДолг,
	|	СУММА(ДеталиРасчетов.СуммаАванс) КАК СуммаАванс,
	|	СУММА(ДеталиРасчетов.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
	|	СУММА(ДеталиРасчетов.СуммаДолгКонтрагент) КАК СуммаДолгКонтрагент,
	|	СУММА(ДеталиРасчетов.СуммаАвансКонтрагент) КАК СуммаАвансКонтрагент,
	|	СУММА(ДеталиРасчетов.СуммаВзаиморасчетовКонтрагент) КАК СуммаВзаиморасчетовКонтрагент,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ТипСуммы,
	|	0 КАК ОсновнойДолг,
	|	0 КАК ОсновнойДолгКонтрагент,
	|	0 КАК Проценты,
	|	0 КАК ПроцентыКонтрагент,
	|	0 КАК Комиссия,
	|	0 КАК КомиссияКонтрагент,
	|	
	|	0 КАК АрендныеОбязательства,
	|	0 КАК АрендныеОбязательстваКонтрагент,
	|	0 КАК ОбеспечительныйПлатеж,
	|	0 КАК ОбеспечительныйПлатежКонтрагент,
	|	0 КАК ЛизинговыйПлатеж,
	|	0 КАК ЛизинговыйПлатежКонтрагент,
	|	0 КАК ВыкупПредметаЛизинга,
	|	0 КАК ВыкупПредметаЛизингаКонтрагент,
	|	
	|	ВЫБОР 
	|		КОГДА ДеталиРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
	|			ТОГДА 10
	|		КОГДА ДеталиРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
	|			ТОГДА 20
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК ПорядокРасчетов,
	|	
	|	0 КАК ПорядокТипаСуммы
	|	
	|ПОМЕСТИТЬ ДетальныеЗаписиДокумента
	|ИЗ
	|	ДеталиРасчетов КАК ДеталиРасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ДеталиРасчетов.ДокументСсылка,
	|	ДеталиРасчетов.ТипРасчетов,
	|	ДеталиРасчетов.ОбъектГруппировки,
	|	ДеталиРасчетов.ПредставлениеОбъектГруппировки,
	|	
	|	ДеталиРасчетов.ЕстьОбороты,
	|	ДеталиРасчетов.РасчетныйДокумент,
	|	ДеталиРасчетов.ОписаниеДокумента,
	|	ДеталиРасчетов.Валюта,
	|	ДеталиРасчетов.ВалютаДокумента,
	|	
	|	ДеталиРасчетов.НачальноеСальдо,
	|	ДеталиРасчетов.НачальноеСальдоДт,
	|	ДеталиРасчетов.НачальноеСальдоКт,
	|	ДеталиРасчетов.ОборотПриход,
	|	ДеталиРасчетов.ОборотРасход,
	|	ДеталиРасчетов.КонечноеСальдо,
	|	ДеталиРасчетов.КонечноеСальдоДт,
	|	ДеталиРасчетов.КонечноеСальдоКт,
	|	
	|	ДеталиРасчетов.СуммаДокумента,
	|	ДеталиРасчетов.СуммаДокументаКонтрагент,
	|	
	|	ВЫБОР 
	|		КОГДА ДеталиРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
	|			ТОГДА 10
	|		КОГДА ДеталиРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
	|			ТОГДА 20
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДетальныеЗаписи.ДокументСсылка КАК ДокументСсылка,
	|	ДетальныеЗаписи.ТипРасчетов КАК ТипРасчетов,
	|	ИСТИНА КАК ФинансовыеИнструменты,
	|	ДетальныеЗаписи.ОбъектГруппировки КАК ОбъектГруппировки,
	|	ДетальныеЗаписи.ПредставлениеОбъектГруппировки КАК ПредставлениеОбъектГруппировки,
	|	
	|	ДетальныеЗаписи.ЕстьОбороты КАК ЕстьОбороты,
	|	ДетальныеЗаписи.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДетальныеЗаписи.ОписаниеДокумента КАК ОписаниеДокумента,
	|	ДетальныеЗаписи.Валюта КАК Валюта,
	|	ДетальныеЗаписи.ВалютаДокумента КАК ВалютаДокумента,
	|	
	|	0 КАК НачальноеСальдо,
	|	ДетальныеЗаписи.НачальноеСальдоДт,
	|	ДетальныеЗаписи.НачальноеСальдоКт,
	|	ДетальныеЗаписи.ОборотПриход,
	|	ДетальныеЗаписи.ОборотРасход,
	|	0 КАК КонечноеСальдо,
	|	ДетальныеЗаписи.КонечноеСальдоДт,
	|	ДетальныеЗаписи.КонечноеСальдоКт,
	|	
	|	СУММА(ДетальныеЗаписи.СуммаДебет) КАК СуммаДебет,
	|	СУММА(ДетальныеЗаписи.СуммаКредит) КАК СуммаКредит,
	|
	|	СУММА(ДетальныеЗаписи.СуммаДебетКонтрагент) КАК СуммаДебетКонтрагент,
	|	СУММА(ДетальныеЗаписи.СуммаКредитКонтрагент) КАК СуммаКредитКонтрагент,
	|	
	|	0 КАК СуммаДокумента,
	|	0 КАК СуммаДокументаКонтрагент,
	|	0 КАК СуммаДолг,
	|	0 КАК СуммаАванс,
	|	0 КАК СуммаВзаиморасчетов,
	|	0 КАК СуммаДолгКонтрагент,
	|	0 КАК СуммаАвансКонтрагент,
	|	0 КАК СуммаВзаиморасчетовКонтрагент,
	|	
	|	ДетальныеЗаписи.ТипСуммы КАК ТипСуммы,
	|	СУММА(ДетальныеЗаписи.ОсновнойДолг) КАК ОсновнойДолг,
	|	СУММА(ДетальныеЗаписи.ОсновнойДолгКонтрагент) КАК ОсновнойДолгКонтрагент,
	|	СУММА(ДетальныеЗаписи.Проценты) КАК Проценты,
	|	СУММА(ДетальныеЗаписи.ПроцентыКонтрагент) КАК ПроцентыКонтрагент,
	|	СУММА(ДетальныеЗаписи.Комиссия) КАК Комиссия,
	|	СУММА(ДетальныеЗаписи.КомиссияКонтрагент) КАК КомиссияКонтрагент,
	|	
	|	СУММА(ДетальныеЗаписи.АрендныеОбязательства) КАК АрендныеОбязательства,
	|	СУММА(ДетальныеЗаписи.АрендныеОбязательстваКонтрагент) КАК АрендныеОбязательстваКонтрагент,
	|	СУММА(ДетальныеЗаписи.ОбеспечительныйПлатеж) КАК ОбеспечительныйПлатеж,
	|	СУММА(ДетальныеЗаписи.ОбеспечительныйПлатежКонтрагент) КАК ОбеспечительныйПлатежКонтрагент,
	|	СУММА(ДетальныеЗаписи.ЛизинговыйПлатеж) КАК ЛизинговыйПлатеж,
	|	СУММА(ДетальныеЗаписи.ЛизинговыйПлатежКонтрагент) КАК ЛизинговыйПлатежКонтрагент,
	|	СУММА(ДетальныеЗаписи.ВыкупПредметаЛизинга) КАК ВыкупПредметаЛизинга,
	|	СУММА(ДетальныеЗаписи.ВыкупПредметаЛизингаКонтрагент) КАК ВыкупПредметаЛизингаКонтрагент,
	|	
	|	ВЫБОР 
	|		КОГДА ДетальныеЗаписи.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКредитором)
	|			ТОГДА 30
	|		КОГДА ДетальныеЗаписи.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСДебитором)
	|			ТОГДА 40
	|		КОГДА ДетальныеЗаписи.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСЛизингодателем)
	|			ТОГДА 50
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК ПорядокРасчетов,
	|	
	|	ВЫБОР 
	|		КОГДА ДетальныеЗаписи.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|			ТОГДА 10
	|		КОГДА ДетальныеЗаписи.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты)
	|			ТОГДА 20
	|		КОГДА ДетальныеЗаписи.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Комиссия)
	|			ТОГДА 30
	|		КОГДА ДетальныеЗаписи.ТипСуммы = &АрендныеОбязательства 
	|			ТОГДА 40
	|		КОГДА ДетальныеЗаписи.ТипСуммы = &ОбеспечительныйПлатеж 
	|			ТОГДА 50
	|		КОГДА ДетальныеЗаписи.ТипСуммы = &ЛизинговыйПлатеж 
	|			ТОГДА 60
	|		КОГДА ДетальныеЗаписи.ТипСуммы = &ВыкупПредметаЛизинга 
	|			ТОГДА 70
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК ПорядокТипаСуммы
	|ИЗ
	|	ДеталиФинИнструментов КАК ДетальныеЗаписи
	|
	|СГРУППИРОВАТЬ ПО
	|	ДетальныеЗаписи.ДокументСсылка,
	|	ДетальныеЗаписи.ТипРасчетов,
	|	ДетальныеЗаписи.ОбъектГруппировки,
	|	ДетальныеЗаписи.ПредставлениеОбъектГруппировки,
	|	
	|	ДетальныеЗаписи.ЕстьОбороты,
	|	ДетальныеЗаписи.РасчетныйДокумент,
	|	ДетальныеЗаписи.ОписаниеДокумента,
	|	ДетальныеЗаписи.Валюта,
	|	ДетальныеЗаписи.ВалютаДокумента,
	|	
	|	ДетальныеЗаписи.НачальноеСальдоДт,
	|	ДетальныеЗаписи.НачальноеСальдоКт,
	|	ДетальныеЗаписи.ОборотПриход,
	|	ДетальныеЗаписи.ОборотРасход,
	|	ДетальныеЗаписи.КонечноеСальдоДт,
	|	ДетальныеЗаписи.КонечноеСальдоКт,
	|	
	|	ДетальныеЗаписи.ТипСуммы,
	|	
	|	ВЫБОР 
	|		КОГДА ДетальныеЗаписи.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКредитором)
	|			ТОГДА 30
	|		КОГДА ДетальныеЗаписи.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСДебитором)
	|			ТОГДА 40
	|		КОГДА ДетальныеЗаписи.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСЛизингодателем)
	|			ТОГДА 50
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ,
	|	
	|	ВЫБОР 
	|		КОГДА ДетальныеЗаписи.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|			ТОГДА 10
	|		КОГДА ДетальныеЗаписи.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты)
	|			ТОГДА 20
	|		КОГДА ДетальныеЗаписи.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Комиссия)
	|			ТОГДА 30
	|		КОГДА ДетальныеЗаписи.ТипСуммы = &АрендныеОбязательства 
	|			ТОГДА 40
	|		КОГДА ДетальныеЗаписи.ТипСуммы = &ОбеспечительныйПлатеж 
	|			ТОГДА 50
	|		КОГДА ДетальныеЗаписи.ТипСуммы = &ЛизинговыйПлатеж
	|			ТОГДА 60
	|		КОГДА ДетальныеЗаписи.ТипСуммы = &ВыкупПредметаЛизинга 
	|			ТОГДА 70
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДеталиДокумента.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументСверки.Организация КАК Организация,
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ДеталиДокумента.РасчетныйДокумент) = ТИП(Документ.КорректировкаРегистров)
	|			ТОГДА КорректировкаРегистров.Дата
	|		ИНАЧЕ
	|			ЕСТЬNULL(РеестрДокументов.ДатаОтраженияВУчете, ДанныеДокументов.ДатаРегистратора)
	|	КОНЕЦ КАК ДатаДокумента,
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ДеталиДокумента.РасчетныйДокумент) = ТИП(Документ.КорректировкаРегистров)
	|			ТОГДА КорректировкаРегистров.Дата
	|		ИНАЧЕ
	|			ЕСТЬNULL(РеестрДокументов.НомерПервичногоДокумента, ДанныеДокументов.НомерРегистратора)
	|	КОНЕЦ КАК НомерДокумента
	|ПОМЕСТИТЬ втДанныеДокументов
	|ИЗ
	|	ДетальныеЗаписиДокумента КАК ДеталиДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СверкаВзаиморасчетов КАК ДокументСверки
	|		ПО ДеталиДокумента.ДокументСсылка = ДокументСверки.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеДокументов
	|		ПО ДеталиДокумента.РасчетныйДокумент = ДанныеДокументов.Документ
	|			И ДокументСверки.Организация = ДанныеДокументов.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ДеталиДокумента.РасчетныйДокумент = РеестрДокументов.Ссылка
	|			И ДокументСверки.Организация = РеестрДокументов.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРегистров КАК КорректировкаРегистров
	|		ПО ДеталиДокумента.РасчетныйДокумент = КорректировкаРегистров.Ссылка
	|ГДЕ
	|	ДокументСверки.Ссылка В(&МассивОбъектов)
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент,
	|	Организация
	|	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументСверки.Ссылка КАК ДокументСсылка,
	|	ЕСТЬNULL(ДеталиДокумента.ТипРасчетов, ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.ПустаяСсылка)) КАК ТипРасчетов,
	|	ПредставлениеСсылки(ЕСТЬNULL(ДеталиДокумента.ТипРасчетов, ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.ПустаяСсылка))) КАК ПредставлениеТипРасчетов,
	|	ДокументСверки.Номер КАК Номер,
	|	ДокументСверки.Дата КАК Дата,
	|	ДокументСверки.Организация КАК Организация,
	|	ДокументСверки.Контрагент КАК Контрагент,
	|	ДокументСверки.Партнер КАК Партнер,
	|	ЕСТЬNULL(ДокументСверки.Партнер.НаименованиеПолное, """") КАК ПредставлениеПартнера,
	|	ДокументСверки.ЕстьРасхождения КАК ЕстьРасхождения,
	|	ДокументСверки.Договор КАК Договор,
	|	&ПредставлениеДоговораНаПечать КАК ПредставлениеДоговора,
	|	ДокументСверки.НачалоПериода КАК НачалоПериода,
	|	ДокументСверки.КонецПериода КАК КонецПериода,
	|	ВЫБОР КОГДА ДокументСверки.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер)
	|		ТОГДА ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование
	|		ИНАЧЕ ТаблицаОтветственныеЛица.РуководительНаименование
	|	КОНЕЦ КАК ФИООтветственногоЛица,
	|	ВЫБОР КОГДА ДокументСверки.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер)
	|		ТОГДА ТаблицаОтветственныеЛица.ГлавныйБухгалтерДолжность
	|		ИНАЧЕ ТаблицаОтветственныеЛица.РуководительДолжность
	|	КОНЕЦ КАК ДолжностьОтветственногоЛица,
	|	ДокументСверки.ФИОРуководителяКонтрагента КАК ФИОРуководителяКонтрагента,
	|	ДокументСверки.ДолжностьРуководителяКонтрагента КАК ДолжностьРуководителяКонтрагента,
	|	
	|	ЕСТЬNULL(ДеталиДокумента.ЕстьОбороты, ЛОЖЬ) КАК ЕстьОбороты,
	|	ЕСТЬNULL(ДеталиДокумента.ФинансовыеИнструменты, ЛОЖЬ) КАК ФинансовыеИнструменты,
	|	ЕСТЬNULL(ДеталиДокумента.ОбъектГруппировки, Неопределено) КАК ОбъектГруппировки,
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ДеталиДокумента.ОбъектГруппировки) = ТИП(Справочник.ДоговорыКонтрагентов)
	|			ТОГДА ДоговорыКонтрагентов.НаименованиеДляПечати
	|		КОГДА ТИПЗНАЧЕНИЯ(ДеталиДокумента.ОбъектГруппировки) = ТИП(Справочник.ДоговорыКредитовИДепозитов)
	|			ТОГДА ДоговорыКредитовДепозитов.НаименованиеДляПечати
	|		ИНАЧЕ ЕСТЬNULL(ДеталиДокумента.ПредставлениеОбъектГруппировки, """")
	|	КОНЕЦ КАК ПредставлениеОбъектГруппировки,
	|	ТИПЗНАЧЕНИЯ(ДеталиДокумента.ОбъектГруппировки) КАК ТипОбъектГруппировки,
	|	ТИПЗНАЧЕНИЯ(ДеталиДокумента.ОбъектГруппировки) = ТИП(Справочник.ДоговорыКонтрагентов) КАК ЭтоДоговор,
	|	ЕСТЬNULL(ДеталиДокумента.РасчетныйДокумент, Неопределено) КАК РасчетныйДокумент,
	|	ЕСТЬNULL(ДеталиДокумента.ОписаниеДокумента, """") КАК ОписаниеДокумента,
	|	ДанныеДокументов.ДатаДокумента КАК ДатаДокумента,
	|	ДанныеДокументов.НомерДокумента КАК НомерДокумента,
	|	ЕСТЬNULL(ДеталиДокумента.Валюта, &ВалютаРегл) КАК Валюта,
	|	ПредставлениеСсылки(ЕСТЬNULL(ДеталиДокумента.Валюта, &ВалютаРегл)) КАК ПредставлениеВалюта,
	|	ЕСТЬNULL(ДеталиДокумента.ВалютаДокумента, &ВалютаРегл) КАК ВалютаДокумента,
	|	ПредставлениеСсылки(ЕСТЬNULL(ДеталиДокумента.ВалютаДокумента, &ВалютаРегл)) КАК ПредставлениеВалютаДокумента,
	|	ЕСТЬNULL(ДеталиДокумента.ТипСуммы, ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ПустаяСсылка)) КАК ТипСуммы,
	|	
	|	ЕСТЬNULL(ДеталиДокумента.НачальноеСальдо, 0) КАК НачальноеСальдо,
	|	ЕСТЬNULL(ДеталиДокумента.НачальноеСальдоДт, 0) КАК НачальноеСальдоДт,
	|	ЕСТЬNULL(ДеталиДокумента.НачальноеСальдоКт, 0) КАК НачальноеСальдоКт,
	|	ЕСТЬNULL(ДеталиДокумента.ОборотПриход, 0) КАК ОборотПриход,
	|	ЕСТЬNULL(ДеталиДокумента.ОборотРасход, 0) КАК ОборотРасход,
	|	ЕСТЬNULL(ДеталиДокумента.КонечноеСальдо, 0) КАК КонечноеСальдо,
	|	ЕСТЬNULL(ДеталиДокумента.КонечноеСальдоДт, 0) КАК КонечноеСальдоДт,
	|	ЕСТЬNULL(ДеталиДокумента.КонечноеСальдоКт, 0) КАК КонечноеСальдоКт,
	|	
	|	ЕСТЬNULL(ДеталиДокумента.СуммаДебет, 0) КАК СуммаДебет,
	|	ЕСТЬNULL(ДеталиДокумента.СуммаКредит, 0) КАК СуммаКредит,
	|	
	|	ЕСТЬNULL(ДеталиДокумента.СуммаДебетКонтрагент, 0) КАК СуммаДебетКонтрагент,
	|	ЕСТЬNULL(ДеталиДокумента.СуммаКредитКонтрагент, 0) КАК СуммаКредитКонтрагент,
	|	
	|	ЕСТЬNULL(ДеталиДокумента.СуммаДокумента, 0) КАК СуммаДокумента,
	|	ЕСТЬNULL(ДеталиДокумента.СуммаДокументаКонтрагент, 0) КАК СуммаДокументаКонтрагент,
	|	ЕСТЬNULL(ДеталиДокумента.СуммаДолг, 0) КАК СуммаДолг,
	|	ЕСТЬNULL(ДеталиДокумента.СуммаАванс, 0) КАК СуммаАванс,
	|	ЕСТЬNULL(ДеталиДокумента.СуммаВзаиморасчетов, 0) КАК СуммаВзаиморасчетов,
	|	ЕСТЬNULL(ДеталиДокумента.СуммаДолгКонтрагент, 0) КАК СуммаДолгКонтрагент,
	|	ЕСТЬNULL(ДеталиДокумента.СуммаАвансКонтрагент, 0) КАК СуммаАвансКонтрагент,
	|	ЕСТЬNULL(ДеталиДокумента.СуммаВзаиморасчетовКонтрагент, 0) КАК СуммаВзаиморасчетовКонтрагент,
	|	
	|	ЕСТЬNULL(ДеталиДокумента.ОсновнойДолг, 0) КАК ОсновнойДолг,
	|	ЕСТЬNULL(ДеталиДокумента.ОсновнойДолгКонтрагент, 0) КАК ОсновнойДолгКонтрагент,
	|	ЕСТЬNULL(ДеталиДокумента.Проценты, 0) КАК Проценты,
	|	ЕСТЬNULL(ДеталиДокумента.ПроцентыКонтрагент, 0) КАК ПроцентыКонтрагент,
	|	ЕСТЬNULL(ДеталиДокумента.Комиссия, 0) КАК Комиссия,
	|	ЕСТЬNULL(ДеталиДокумента.КомиссияКонтрагент, 0) КАК КомиссияКонтрагент,
	|	
	|	ЕСТЬNULL(ДеталиДокумента.АрендныеОбязательства, 0) КАК АрендныеОбязательства,
	|	ЕСТЬNULL(ДеталиДокумента.АрендныеОбязательстваКонтрагент, 0) КАК АрендныеОбязательстваКонтрагент,
	|	ЕСТЬNULL(ДеталиДокумента.ОбеспечительныйПлатеж, 0) КАК ОбеспечительныйПлатеж,
	|	ЕСТЬNULL(ДеталиДокумента.ОбеспечительныйПлатежКонтрагент, 0) КАК ОбеспечительныйПлатежКонтрагент,
	|	ЕСТЬNULL(ДеталиДокумента.ЛизинговыйПлатеж, 0) КАК ЛизинговыйПлатеж,
	|	ЕСТЬNULL(ДеталиДокумента.ЛизинговыйПлатежКонтрагент, 0) КАК ЛизинговыйПлатежКонтрагент,
	|	ЕСТЬNULL(ДеталиДокумента.ВыкупПредметаЛизинга, 0) КАК ВыкупПредметаЛизинга,
	|	ЕСТЬNULL(ДеталиДокумента.ВыкупПредметаЛизингаКонтрагент, 0) КАК ВыкупПредметаЛизингаКонтрагент,
	|	
	|	ЕСТЬNULL(ДеталиДокумента.ПорядокРасчетов, 0) КАК ПорядокРасчетов
	|ИЗ
	|	Документ.СверкаВзаиморасчетов КАК ДокументСверки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО ДокументСверки.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДетальныеЗаписиДокумента КАК ДеталиДокумента
	|		ПО ДокументСверки.Ссылка = ДеталиДокумента.ДокументСсылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ДеталиДокумента.ОбъектГруппировки = ДоговорыКонтрагентов.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКредитовИДепозитов КАК ДоговорыКредитовДепозитов
	|		ПО ДеталиДокумента.ОбъектГруппировки = ДоговорыКредитовДепозитов.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДанныеДокументов КАК ДанныеДокументов
	|		ПО ДеталиДокумента.РасчетныйДокумент = ДанныеДокументов.РасчетныйДокумент
	|			И ДокументСверки.Организация = ДанныеДокументов.Организация
	|ГДЕ
	|	ДокументСверки.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокумента,
	|	ОписаниеДокумента,
	|	ПорядокТипаСуммы
	|
	|ИТОГИ
	|	МАКСИМУМ(НачальноеСальдо),
	|	МАКСИМУМ(НачальноеСальдоДт),
	|	МАКСИМУМ(НачальноеСальдоКт),
	|	МАКСИМУМ(ОборотПриход),
	|	МАКСИМУМ(ОборотРасход),
	|	МАКСИМУМ(КонечноеСальдо),
	|	МАКСИМУМ(КонечноеСальдоДт),
	|	МАКСИМУМ(КонечноеСальдоКт),
	|	
	|	МАКСИМУМ(ФИООтветственногоЛица),
	|	МАКСИМУМ(ДолжностьОтветственногоЛица),
	|	МАКСИМУМ(ФИОРуководителяКонтрагента),
	|	МАКСИМУМ(ДолжностьРуководителяКонтрагента),
	|	МАКСИМУМ(ПредставлениеВалюта),
	|	МАКСИМУМ(ВалютаДокумента),
	|	МАКСИМУМ(ПредставлениеВалютаДокумента),
	|	МАКСИМУМ(ПредставлениеОбъектГруппировки),
	|	МАКСИМУМ(ФинансовыеИнструменты),
	|	МАКСИМУМ(ЕстьОбороты),
	|	МАКСИМУМ(ЕстьРасхождения),
	|
	|	СУММА(СуммаДебет),
	|	СУММА(СуммаКредит),
	|	
	|	СУММА(СуммаДебетКонтрагент),
	|	СУММА(СуммаКредитКонтрагент),
	|	
	|	СУММА(СуммаДокумента),
	|	СУММА(СуммаДокументаКонтрагент),
	|	СУММА(СуммаДолг),
	|	СУММА(СуммаАванс),
	|	СУММА(СуммаВзаиморасчетов),
	|	СУММА(СуммаДолгКонтрагент),
	|	СУММА(СуммаАвансКонтрагент),
	|	СУММА(СуммаВзаиморасчетовКонтрагент),
	|	
	|	СУММА(ОсновнойДолг),
	|	СУММА(ОсновнойДолгКонтрагент),
	|	СУММА(Проценты),
	|	СУММА(ПроцентыКонтрагент),
	|	СУММА(Комиссия),
	|	СУММА(КомиссияКонтрагент),
	|	
	|	СУММА(АрендныеОбязательства),
	|	СУММА(АрендныеОбязательстваКонтрагент),
	|	СУММА(ОбеспечительныйПлатеж),
	|	СУММА(ОбеспечительныйПлатежКонтрагент),
	|	СУММА(ЛизинговыйПлатеж),
	|	СУММА(ОбеспечительныйПлатежКонтрагент),
	|	СУММА(ЛизинговыйПлатеж),
	|	СУММА(ЛизинговыйПлатежКонтрагент),
	|	СУММА(ВыкупПредметаЛизинга),
	|	СУММА(ВыкупПредметаЛизингаКонтрагент)
	|ПО
	|	ДокументСсылка,
	|	ТипРасчетов,
	|	Валюта,
	|	ОбъектГруппировки
	|
	|АВТОУПОРЯДОЧИВАНИЕ";
	#КонецОбласти

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
						"ГруппировкаРасчетов.Договор",
						"ГруппировкаРасчетов." + НастройкиПечати.ДетализацияВзаиморасчетов);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
						"ДетальныеЗаписиРасчетов.Договор",
						"ДетальныеЗаписиРасчетов." + НастройкиПечати.ДетализацияВзаиморасчетов);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
						"ГруппировкаФинИнструментов.Договор",
						"ГруппировкаФинИнструментов." + НастройкиПечати.ДетализацияФинансовыхИнструментов);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
						"= ДеталиФинИнструментов.Договор",
						"= ДеталиФинИнструментов." + НастройкиПечати.ДетализацияФинансовыхИнструментов);
	
	ПредставлениеДоговораНаПечать = "ЕСТЬNULL(ДокументСверки.Договор.НаименованиеДляПечати, """")";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПредставлениеДоговораНаПечать", ПредставлениеДоговораНаПечать);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПредставлениеПартнера(Партнер)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ 
	|	Партнеры.НаименованиеПолное КАК НаименованиеПолное
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|ГДЕ
	|	Партнеры.Ссылка = &Партнер
	|");
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПредставлениеПартнера = Выборка.НаименованиеПолное;
	Иначе
		ПредставлениеПартнера = "";
	КонецЕсли;
	
	Возврат ПредставлениеПартнера;
	
КонецФункции

Функция ПредставлениеДоговора(Договор)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ 
	|	ДоговорыКонтрагентов.НаименованиеДляПечати КАК НаименованиеДляПечати
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Договор
	|");
	Запрос.УстановитьПараметр("Договор", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПредставлениеДоговора = Выборка.НаименованиеДляПечати;
	Иначе
		ПредставлениеДоговора = "";
	КонецЕсли;
	
	Возврат ПредставлениеДоговора;
	
КонецФункции

Функция ПредставленияДокументов()
	
	ВидыДокументовКонтрагента = Новый Структура;
	
	ВидыДокументовКонтрагента.Вставить("АвансовыйОтчет",                        НСтр("ru='Приходный кассовый ордер'"));
	ВидыДокументовКонтрагента.Вставить("АктВыполненныхРабот",                   НСтр("ru='Акт выполненных работ'"));
	ВидыДокументовКонтрагента.Вставить("ВводОстатков",                          НСтр("ru='Корректировка задолженности'"));
	ВидыДокументовКонтрагента.Вставить("ВзаимозачетЗадолженности",              НСтр("ru='Взаимозачет задолженности'"));
	ВидыДокументовКонтрагента.Вставить("ВозвратТоваровМеждуОрганизациями",      НСтр("ru='Возврат товаров'"));
	ВидыДокументовКонтрагента.Вставить("ВозвратТоваровОтКлиента",               НСтр("ru='Возврат товаров'"));
	ВидыДокументовКонтрагента.Вставить("ВозвратТоваровПоставщику",              НСтр("ru='Возврат товаров'"));
	ВидыДокументовКонтрагента.Вставить("ВыкупВозвратнойТарыКлиентом",           НСтр("ru='Выкуп возвратной тары'"));
	ВидыДокументовКонтрагента.Вставить("ВыкупВозвратнойТарыУПоставщика",        НСтр("ru='Выкуп возвратной тары'"));
	ВидыДокументовКонтрагента.Вставить("ВыкупПринятыхНаХранениеТоваров",        НСтр("ru='Закупка'"));
	ВидыДокументовКонтрагента.Вставить("ВыкупТоваровХранителем",                НСтр("ru='Продажа'"));
	ВидыДокументовКонтрагента.Вставить("КорректировкаЗадолженностиПоФинансовымИнструментам", НСтр("ru='Корректировка задолженности'"));
	ВидыДокументовКонтрагента.Вставить("КорректировкаПриобретения",             НСтр("ru='Корректировка задолженности'"));
	ВидыДокументовКонтрагента.Вставить("КорректировкаРеализации",               НСтр("ru='Корректировка задолженности'"));
	ВидыДокументовКонтрагента.Вставить("КорректировкаРегистров",                НСтр("ru='Корректировка задолженности'"));
	ВидыДокументовКонтрагента.Вставить("НачисленияКредитовИДепозитов",          НСтр("ru='Начисление'"));
	ВидыДокументовКонтрагента.Вставить("ОперацияПоПлатежнойКарте",              НСтр("ru='Эквайринговая операция'"));
	ВидыДокументовКонтрагента.Вставить("ОперацияПоЯндексКассе",                 НСтр("ru='Эквайринговая операция'"));
	ВидыДокументовКонтрагента.Вставить("ОтчетКомиссионера",                     НСтр("ru='Отчет комитенту'"));
	ВидыДокументовКонтрагента.Вставить("ОтчетКомиссионераОСписании",            НСтр("ru='Отчет комитенту'"));
	ВидыДокументовКонтрагента.Вставить("ОтчетКомитенту",                        НСтр("ru='Отчет комитенту'"));
	ВидыДокументовКонтрагента.Вставить("ОтчетКомитентуОСписании",               НСтр("ru='Отчет комитенту'"));
	ВидыДокументовКонтрагента.Вставить("ОтчетПоКомиссииМеждуОрганизациями",     НСтр("ru='Отчет комитенту'"));
	ВидыДокументовКонтрагента.Вставить("ОтчетПоКомиссииМеждуОрганизациямиОСписании",НСтр("ru='Отчет комитенту'"));
	ВидыДокументовКонтрагента.Вставить("ПередачаТоваровМеждуОрганизациямиЗакупка",  НСтр("ru='Закупка'"));
	ВидыДокументовКонтрагента.Вставить("ПередачаТоваровМеждуОрганизациямиПродажа",  НСтр("ru='Продажа'"));
	ВидыДокументовКонтрагента.Вставить("ПоступлениеБезналичныхДенежныхСредств", НСтр("ru='Платежное поручение'"));
	ВидыДокументовКонтрагента.Вставить("ПриобретениеТоваровУслуг",              НСтр("ru='Закупка'"));
	ВидыДокументовКонтрагента.Вставить("ПриобретениеУслугПрочихАктивов",        НСтр("ru='Акт'"));
	ВидыДокументовКонтрагента.Вставить("ПриходныйКассовыйОрдер",                НСтр("ru='Приходный кассовый ордер'"));
	ВидыДокументовКонтрагента.Вставить("РасходныйКассовыйОрдер",                НСтр("ru='Расходный кассовый ордер'"));
	ВидыДокументовКонтрагента.Вставить("РасчетКурсовыхРазниц",                  НСтр("ru='Курсовые разницы'"));
	ВидыДокументовКонтрагента.Вставить("РеализацияТоваровУслуг",                НСтр("ru='Продажа'"));
	ВидыДокументовКонтрагента.Вставить("РеализацияУслугПрочихАктивов",          НСтр("ru='Акт'"));
	ВидыДокументовКонтрагента.Вставить("СписаниеБезналичныхДенежныхСредств",    НСтр("ru='Платежное поручение'"));
	ВидыДокументовКонтрагента.Вставить("СписаниеЗадолженности",                 НСтр("ru='Списание задолженности'"));
	ВидыДокументовКонтрагента.Вставить("СчетФактураВыданный",                   НСтр("ru='Счет-фактура'"));
	ВидыДокументовКонтрагента.Вставить("СчетФактураПолученный",                 НСтр("ru='Счет-фактура'"));
	ВидыДокументовКонтрагента.Вставить("СчетФактураПолученныйНалоговыйАгент",   НСтр("ru='Счет-фактура'"));
	ВидыДокументовКонтрагента.Вставить("ТаможеннаяДекларацияИмпорт",            НСтр("ru='Таможенная декларация'"));
	
	Возврат ВидыДокументовКонтрагента;
	
КонецФункции

Функция ПредставленияВладельцевДокументов()
	
	ВидыДокументовКонтрагента = Новый Структура;

	ВидыДокументовКонтрагента.Вставить("АвансовыйОтчет",                        НСтр("ru='получатель'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("АктВыполненныхРабот",                   НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("ВозвратТоваровМеждуОрганизациями",      НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("ВозвратТоваровОтКлиента",               НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("ВозвратТоваровПоставщику",              НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("ЗаказКлиента",                          НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("ЗаказПоставщику",                       НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("ЗаявкаНаВозвратТоваровОтКлиента",       НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("КорректировкаПриобретения",             НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("КорректировкаРеализации",               НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("ОперацияПоПлатежнойКарте",              НСтр("ru='плательщик'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("ОтчетКомиссионера",                     НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("ОтчетКомиссионераОСписании",            НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("ОтчетКомитенту",                        НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("ОтчетКомитентуОСписании",               НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("ОтчетПоКомиссииМеждуОрганизациями",     НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("ПередачаТоваровМеждуОрганизациями",     НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("ПоступлениеБезналичныхДенежныхСредств", НСтр("ru='плательщик'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("ПриобретениеТоваровУслуг",              НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("ПриобретениеУслугПрочихАктивов",        НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("ПриходныйКассовыйОрдер",                НСтр("ru='получатель'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("РасходныйКассовыйОрдер",                НСтр("ru='плательщик'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("РеализацияТоваровУслуг",                НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("РеализацияУслугПрочихАктивов",          НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("СписаниеБезналичныхДенежныхСредств",    НСтр("ru='плательщик'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("СчетНаОплатуКлиенту",                   НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("СчетФактураВыданный",                   НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("СчетФактураПолученный",                 НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("СчетФактураПолученныйНалоговыйАгент",   НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ВидыДокументовКонтрагента.Вставить("ТаможеннаяДекларацияИмпорт",            НСтр("ru='от'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	Возврат ВидыДокументовКонтрагента;
	
КонецФункции

Функция УбратьЛидирующиеНули(Строка)
	
	Рез = СокрЛП(Строка);
	Пока Лев(Рез, 1) = "0" ИЛИ Лев(Рез, 1) = "-" Цикл 
		Рез = Сред(Рез, 2);
	КонецЦикла;
	Возврат Рез;
	
КонецФункции

Процедура ОчиститьДебетКредит(Область)
	
	ПараметрыОбласти = Новый Структура("СуммаДебет,СуммаКредит,СуммаДебетКонтрагент,СуммаКредитКонтрагент");
	ЗаполнитьЗначенияСвойств(ПараметрыОбласти, Область.Параметры);
	
	Область.Параметры.СуммаДебет = 0;
	Область.Параметры.СуммаКредит = 0;
	Если ПараметрыОбласти.СуммаДебетКонтрагент <> Неопределено Тогда 
		Область.Параметры.СуммаДебетКонтрагент = 0;
	КонецЕсли;
	Если ПараметрыОбласти.СуммаКредитКонтрагент <> Неопределено Тогда 
		Область.Параметры.СуммаКредитКонтрагент = 0;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОборотКонтрагента(Обороты, Источник, ВыводитьДолгАванс)
	
	Если ВыводитьДолгАванс Тогда
		Обороты.СуммаДебетКонтрагент = Обороты.СуммаДебетКонтрагент + Источник.СуммаДолгКонтрагент;
		Обороты.СуммаКредитКонтрагент = Обороты.СуммаКредитКонтрагент + Источник.СуммаАвансКонтрагент;
	Иначе
		Обороты.СуммаДебетКонтрагент = Обороты.СуммаДебетКонтрагент + Источник.СуммаДебетКонтрагент;
		Обороты.СуммаКредитКонтрагент = Обороты.СуммаКредитКонтрагент + Источник.СуммаКредитКонтрагент;
	КонецЕсли;
	
КонецПроцедуры

Процедура КонечноеСальдо(КонечноеСальдоДт, КонечноеСальдоКт)
	
	КонечноеСальдо = КонечноеСальдоДт - КонечноеСальдоКт;
	Если КонечноеСальдо > 0 Тогда
		КонечноеСальдоДт = КонечноеСальдо;
		КонечноеСальдоКт = 0;
	Иначе
		КонечноеСальдоДт = 0;
		КонечноеСальдоКт = -КонечноеСальдо;
	КонецЕсли;
	
КонецПроцедуры








